; ModuleID = 'prod_cons_kern.c'
source_filename = "prod_cons_kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.inner_array = type { ptr, ptr, ptr, ptr }
%struct.anon = type { ptr, ptr, ptr, ptr }
%struct.hash_key = type { i32 }

@inner_index = dso_local local_unnamed_addr global [10 x i32] zeroinitializer, align 4, !dbg !0
@inner_array0 = dso_local global %struct.inner_array zeroinitializer, section ".maps", align 8, !dbg !133
@inner_array1 = dso_local global %struct.inner_array zeroinitializer, section ".maps", align 8, !dbg !135
@inner_array2 = dso_local global %struct.inner_array zeroinitializer, section ".maps", align 8, !dbg !137
@inner_array3 = dso_local global %struct.inner_array zeroinitializer, section ".maps", align 8, !dbg !139
@inner_array4 = dso_local global %struct.inner_array zeroinitializer, section ".maps", align 8, !dbg !141
@inner_array5 = dso_local global %struct.inner_array zeroinitializer, section ".maps", align 8, !dbg !143
@inner_array6 = dso_local global %struct.inner_array zeroinitializer, section ".maps", align 8, !dbg !145
@inner_array7 = dso_local global %struct.inner_array zeroinitializer, section ".maps", align 8, !dbg !147
@inner_array8 = dso_local global %struct.inner_array zeroinitializer, section ".maps", align 8, !dbg !149
@inner_array9 = dso_local global %struct.inner_array zeroinitializer, section ".maps", align 8, !dbg !151

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "inner_index", scope: !2, file: !3, line: 18, type: !38, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !20, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "prod_cons_kern.c", directory: "/home/pvvalenc/benchmark/benchmark_XDP_map/xdp/prod_cons", checksumkind: CSK_MD5, checksum: "a6ca22be041c66e520a57653bee69c1f")
!4 = !{!5, !14}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 5436, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/linux/bpf.h", directory: "", checksumkind: CSK_MD5, checksum: "3810ac036d82ed3898d498c10e871015")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2)
!12 = !DIEnumerator(name: "XDP_TX", value: 3)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 1168, baseType: !7, size: 32, elements: !15)
!15 = !{!16, !17, !18, !19}
!16 = !DIEnumerator(name: "BPF_ANY", value: 0)
!17 = !DIEnumerator(name: "BPF_NOEXIST", value: 1)
!18 = !DIEnumerator(name: "BPF_EXIST", value: 2)
!19 = !DIEnumerator(name: "BPF_F_LOCK", value: 4)
!20 = !{!0, !21, !70, !99, !104, !109, !111, !116, !121, !133, !135, !137, !139, !141, !143, !145, !147, !149, !151, !153, !159, !166, !174, !185, !190}
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "outer_hash", scope: !2, file: !3, line: 57, type: !23, isLocal: false, isDefinition: true)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "outer_hash", file: !3, line: 52, size: 192, elements: !24)
!24 = !{!25, !31, !36, !41}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !23, file: !3, line: 53, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 416, elements: !29)
!28 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!29 = !{!30}
!30 = !DISubrange(count: 13)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !23, file: !3, line: 54, baseType: !32, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_key", file: !3, line: 25, size: 32, elements: !34)
!34 = !{!35}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !33, file: !3, line: 26, baseType: !28, size: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !23, file: !3, line: 55, baseType: !37, size: 64, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 320, elements: !39)
!39 = !{!40}
!40 = !DISubrange(count: 10)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !23, file: !3, line: 56, baseType: !42, offset: 192)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, elements: !68)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inner_array", file: !3, line: 36, size: 256, elements: !45)
!45 = !{!46, !51, !55, !63}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !44, file: !3, line: 37, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 64, elements: !49)
!49 = !{!50}
!50 = !DISubrange(count: 2)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !44, file: !3, line: 38, baseType: !52, size: 64, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !54, line: 27, baseType: !7)
!54 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!55 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !44, file: !3, line: 39, baseType: !56, size: 64, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "map_elem", file: !3, line: 20, size: 128, elements: !58)
!58 = !{!59, !62}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "occupied", scope: !57, file: !3, line: 21, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !54, line: 31, baseType: !61)
!61 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !57, file: !3, line: 22, baseType: !60, size: 64, offset: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !44, file: !3, line: 40, baseType: !64, size: 64, offset: 192)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 480, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 15)
!68 = !{!69}
!69 = !DISubrange(count: -1)
!70 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!71 = distinct !DIGlobalVariable(name: "____fmt", scope: !72, file: !3, line: 101, type: !94, isLocal: true, isDefinition: true)
!72 = distinct !DISubprogram(name: "testing_prod_cons", scope: !3, file: !3, line: 89, type: !73, scopeLine: 90, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !84)
!73 = !DISubroutineType(types: !74)
!74 = !{!28, !75}
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 5447, size: 192, elements: !77)
!77 = !{!78, !79, !80, !81, !82, !83}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !76, file: !6, line: 5448, baseType: !53, size: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !76, file: !6, line: 5449, baseType: !53, size: 32, offset: 32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !76, file: !6, line: 5450, baseType: !53, size: 32, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !76, file: !6, line: 5452, baseType: !53, size: 32, offset: 96)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !76, file: !6, line: 5453, baseType: !53, size: 32, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "egress_ifindex", scope: !76, file: !6, line: 5455, baseType: !53, size: 32, offset: 160)
!84 = !{!85, !86, !87, !88, !89, !91, !93}
!85 = !DILocalVariable(name: "ctx", arg: 1, scope: !72, file: !3, line: 89, type: !75)
!86 = !DILocalVariable(name: "cpu", scope: !72, file: !3, line: 100, type: !53)
!87 = !DILocalVariable(name: "key", scope: !72, file: !3, line: 113, type: !33)
!88 = !DILocalVariable(name: "i", scope: !72, file: !3, line: 116, type: !28)
!89 = !DILocalVariable(name: "inner", scope: !90, file: !3, line: 119, type: !43)
!90 = distinct !DILexicalBlock(scope: !72, file: !3, line: 117, column: 46)
!91 = !DILocalVariable(name: "index", scope: !90, file: !3, line: 127, type: !92)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!93 = !DILocalVariable(name: "inner_elem", scope: !90, file: !3, line: 134, type: !56)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 24, elements: !97)
!95 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!96 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!97 = !{!98}
!98 = !DISubrange(count: 3)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(name: "____fmt", scope: !72, file: !3, line: 122, type: !101, isLocal: true, isDefinition: true)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 256, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 32)
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(name: "____fmt", scope: !72, file: !3, line: 129, type: !106, isLocal: true, isDefinition: true)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 248, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 31)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "____fmt", scope: !72, file: !3, line: 136, type: !101, isLocal: true, isDefinition: true)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "____fmt", scope: !72, file: !3, line: 141, type: !113, isLocal: true, isDefinition: true)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 200, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 25)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 168, type: !118, isLocal: false, isDefinition: true)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 32, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 4)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "index_hash", scope: !2, file: !3, line: 34, type: !123, isLocal: false, isDefinition: true)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 29, size: 256, elements: !124)
!124 = !{!125, !130, !131, !132}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !123, file: !3, line: 30, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 32, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 1)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !123, file: !3, line: 31, baseType: !32, size: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !123, file: !3, line: 32, baseType: !92, size: 64, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !123, file: !3, line: 33, baseType: !37, size: 64, offset: 192)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "inner_array0", scope: !2, file: !3, line: 41, type: !44, isLocal: false, isDefinition: true)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(name: "inner_array1", scope: !2, file: !3, line: 42, type: !44, isLocal: false, isDefinition: true)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "inner_array2", scope: !2, file: !3, line: 43, type: !44, isLocal: false, isDefinition: true)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "inner_array3", scope: !2, file: !3, line: 44, type: !44, isLocal: false, isDefinition: true)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "inner_array4", scope: !2, file: !3, line: 45, type: !44, isLocal: false, isDefinition: true)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "inner_array5", scope: !2, file: !3, line: 46, type: !44, isLocal: false, isDefinition: true)
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "inner_array6", scope: !2, file: !3, line: 47, type: !44, isLocal: false, isDefinition: true)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(name: "inner_array7", scope: !2, file: !3, line: 48, type: !44, isLocal: false, isDefinition: true)
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(name: "inner_array8", scope: !2, file: !3, line: 49, type: !44, isLocal: false, isDefinition: true)
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "inner_array9", scope: !2, file: !3, line: 50, type: !44, isLocal: false, isDefinition: true)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "bpf_get_smp_processor_id", scope: !2, file: !155, line: 206, type: !156, isLocal: true, isDefinition: true)
!155 = !DIFile(filename: "../lib/install/include/bpf/bpf_helper_defs.h", directory: "/home/pvvalenc/benchmark/benchmark_XDP_map/xdp/prod_cons", checksumkind: CSK_MD5, checksum: "7422ca06c9dc86eba2f268a57d8acf2f")
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!53}
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !155, line: 177, type: !161, isLocal: true, isDefinition: true)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!164, !165, !53, null}
!164 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !155, line: 56, type: !168, isLocal: true, isDefinition: true)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!171, !171, !172}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "____fmt", scope: !176, file: !3, line: 78, type: !106, isLocal: true, isDefinition: true)
