; ModuleID = 'xdp_prog_kern.c'
source_filename = "xdp_prog_kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.inner_map_queue = type { [22 x i32]*, i32*, [1248 x i32]* }
%struct.anon.0 = type { [2 x i32]*, i32*, i64*, [8 x i32]* }
%struct.xdp_md = type { i32, i32, i32, i32, i32 }

@inner_map_queue0 = dso_local global %struct.inner_map_queue zeroinitializer, section ".maps", align 8, !dbg !0
@inner_map_queue1 = dso_local global %struct.inner_map_queue zeroinitializer, section ".maps", align 8, !dbg !99
@inner_map_queue2 = dso_local global %struct.inner_map_queue zeroinitializer, section ".maps", align 8, !dbg !101
@inner_map_queue3 = dso_local global %struct.inner_map_queue zeroinitializer, section ".maps", align 8, !dbg !103
@inner_map_queue4 = dso_local global %struct.inner_map_queue zeroinitializer, section ".maps", align 8, !dbg !105
@inner_map_queue5 = dso_local global %struct.inner_map_queue zeroinitializer, section ".maps", align 8, !dbg !107
@inner_map_queue6 = dso_local global %struct.inner_map_queue zeroinitializer, section ".maps", align 8, !dbg !109
@inner_map_queue7 = dso_local global %struct.inner_map_queue zeroinitializer, section ".maps", align 8, !dbg !111

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "inner_map_queue0", scope: !2, file: !3, line: 26, type: !40, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 11.0.0-2~ubuntu20.04.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !14, globals: !17, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "xdp_prog_kern.c", directory: "/tmp/test3/XDP-Tryouts/user_kernel_com/user_kernel")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 3150, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/linux/bpf.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "XDP_TX", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4, isUnsigned: true)
!14 = !{!15, !16}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!16 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!17 = !{!18, !55, !81, !86, !0, !99, !101, !103, !105, !107, !109, !111, !113, !119, !126, !132, !146, !151}
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "outer_map_queue", scope: !2, file: !3, line: 34, type: !20, isLocal: false, isDefinition: true)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 29, size: 192, elements: !21)
!21 = !{!22, !28, !33, !37}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !20, file: !3, line: 30, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 384, elements: !26)
!25 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!26 = !{!27}
!27 = !DISubrange(count: 12)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !20, file: !3, line: 31, baseType: !29, size: 64, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 256, elements: !31)
!31 = !{!32}
!32 = !DISubrange(count: 8)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !20, file: !3, line: 32, baseType: !34, size: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !36, line: 27, baseType: !7)
!36 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "")
!37 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !20, file: !3, line: 33, baseType: !38, offset: 192)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, elements: !53)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inner_map_queue", file: !3, line: 22, size: 192, elements: !41)
!41 = !{!42, !47, !48}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !40, file: !3, line: 23, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 704, elements: !45)
!45 = !{!46}
!46 = !DISubrange(count: 22)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !40, file: !3, line: 24, baseType: !34, size: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !40, file: !3, line: 25, baseType: !49, size: 64, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 39936, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 1248)
!53 = !{!54}
!54 = !DISubrange(count: -1)
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "____fmt", scope: !57, file: !3, line: 85, type: !76, isLocal: true, isDefinition: true)
!57 = distinct !DISubprogram(name: "simply_drop", scope: !3, file: !3, line: 73, type: !58, scopeLine: 74, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !68)
!58 = !DISubroutineType(types: !59)
!59 = !{!25, !60}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 3161, size: 160, elements: !62)
!62 = !{!63, !64, !65, !66, !67}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !61, file: !6, line: 3162, baseType: !35, size: 32)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !61, file: !6, line: 3163, baseType: !35, size: 32, offset: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !61, file: !6, line: 3164, baseType: !35, size: 32, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !61, file: !6, line: 3166, baseType: !35, size: 32, offset: 96)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !61, file: !6, line: 3167, baseType: !35, size: 32, offset: 128)
!68 = !{!69, !70, !71, !72, !73}
!69 = !DILocalVariable(name: "ctx", arg: 1, scope: !57, file: !3, line: 73, type: !60)
!70 = !DILocalVariable(name: "cpu", scope: !57, file: !3, line: 76, type: !25)
!71 = !DILocalVariable(name: "data_end", scope: !57, file: !3, line: 78, type: !15)
!72 = !DILocalVariable(name: "data", scope: !57, file: !3, line: 79, type: !15)
!73 = !DILocalVariable(name: "counter", scope: !57, file: !3, line: 83, type: !74)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !36, line: 31, baseType: !75)
!75 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 288, elements: !79)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!78 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!79 = !{!80}
!80 = !DISubrange(count: 36)
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 99, type: !83, isLocal: false, isDefinition: true)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 32, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 4)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(name: "counter_array", scope: !2, file: !3, line: 20, type: !88, isLocal: false, isDefinition: true)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 15, size: 256, elements: !89)
!89 = !{!90, !95, !96, !98}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !88, file: !3, line: 16, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 64, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 2)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !88, file: !3, line: 17, baseType: !34, size: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !88, file: !3, line: 18, baseType: !97, size: 64, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !88, file: !3, line: 19, baseType: !29, size: 64, offset: 192)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(name: "inner_map_queue1", scope: !2, file: !3, line: 26, type: !40, isLocal: false, isDefinition: true)
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(name: "inner_map_queue2", scope: !2, file: !3, line: 26, type: !40, isLocal: false, isDefinition: true)
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "inner_map_queue3", scope: !2, file: !3, line: 26, type: !40, isLocal: false, isDefinition: true)
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(name: "inner_map_queue4", scope: !2, file: !3, line: 27, type: !40, isLocal: false, isDefinition: true)
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(name: "inner_map_queue5", scope: !2, file: !3, line: 27, type: !40, isLocal: false, isDefinition: true)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "inner_map_queue6", scope: !2, file: !3, line: 27, type: !40, isLocal: false, isDefinition: true)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "inner_map_queue7", scope: !2, file: !3, line: 27, type: !40, isLocal: false, isDefinition: true)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(name: "bpf_get_smp_processor_id", scope: !2, file: !115, line: 206, type: !116, isLocal: true, isDefinition: true)
!115 = !DIFile(filename: "../lib/install/include/bpf/bpf_helper_defs.h", directory: "/tmp/test3/XDP-Tryouts/user_kernel_com/user_kernel")
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!35}
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !115, line: 56, type: !121, isLocal: true, isDefinition: true)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DISubroutineType(types: !123)
!123 = !{!15, !15, !124}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !115, line: 177, type: !128, isLocal: true, isDefinition: true)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DISubroutineType(types: !130)
!130 = !{!16, !131, !35, null}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(name: "____fmt", scope: !134, file: !3, line: 55, type: !143, isLocal: true, isDefinition: true)
!134 = distinct !DISubprogram(name: "lookup_map_of_maps_queue", scope: !3, file: !3, line: 51, type: !135, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !137)
!135 = !DISubroutineType(types: !136)
!136 = !{!25, !25, !25}
!137 = !{!138, !139, !140, !141}
!138 = !DILocalVariable(name: "key", arg: 1, scope: !134, file: !3, line: 51, type: !25)
!139 = !DILocalVariable(name: "number", arg: 2, scope: !134, file: !3, line: 51, type: !25)
!140 = !DILocalVariable(name: "map", scope: !134, file: !3, line: 52, type: !39)
!141 = !DILocalVariable(name: "i", scope: !142, file: !3, line: 60, type: !25)
!142 = distinct !DILexicalBlock(scope: !134, file: !3, line: 59, column: 24)
