; ModuleID = 'xdp_prog_kern.c'
source_filename = "xdp_prog_kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.inner_map_array = type { ptr, ptr, ptr, ptr }
%struct.inner_map_queue = type { ptr, ptr, ptr }
%struct.inner_array_hash = type { ptr, ptr, ptr, ptr }
%struct.anon.1 = type { ptr, ptr, ptr, ptr }
%struct.anon.2 = type { ptr, ptr, ptr, ptr }
%struct.anon.3 = type { ptr, ptr, ptr, ptr }
%struct.anon.4 = type { ptr, ptr, ptr, ptr }
%struct.anon.5 = type { ptr, ptr, ptr, ptr }
%struct.anon.6 = type { ptr, ptr, ptr, ptr }
%struct.map_locked_value = type { i64, %struct.bpf_spin_lock }
%struct.bpf_spin_lock = type { i32 }
%struct.hash_key = type { i32 }

@inner_map_array0 = dso_local global %struct.inner_map_array zeroinitializer, section ".maps", align 8, !dbg !0
@inner_map_array1 = dso_local global %struct.inner_map_array zeroinitializer, section ".maps", align 8, !dbg !280
@inner_map_array2 = dso_local global %struct.inner_map_array zeroinitializer, section ".maps", align 8, !dbg !282
@inner_map_array3 = dso_local global %struct.inner_map_array zeroinitializer, section ".maps", align 8, !dbg !284
@inner_map_array4 = dso_local global %struct.inner_map_array zeroinitializer, section ".maps", align 8, !dbg !286
@inner_map_array5 = dso_local global %struct.inner_map_array zeroinitializer, section ".maps", align 8, !dbg !288

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "inner_map_array0", scope: !2, file: !3, line: 32, type: !43, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "Ubuntu clang version 16.0.6 (++20231112100510+7cbf1a259152-1~exp1~20231112100554.106)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !20, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "xdp_prog_kern.c", directory: "/home/pvvalenc/benchmark/benchmark_XDP_map/xdp/benchmark", checksumkind: CSK_MD5, checksum: "8ce7c758e50711d50a93a73228a265f3")
!4 = !{!5, !14}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 5436, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/linux/bpf.h", directory: "", checksumkind: CSK_MD5, checksum: "3810ac036d82ed3898d498c10e871015")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2)
!12 = !DIEnumerator(name: "XDP_TX", value: 3)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 1168, baseType: !7, size: 32, elements: !15)
!15 = !{!16, !17, !18, !19}
!16 = !DIEnumerator(name: "BPF_ANY", value: 0)
!17 = !DIEnumerator(name: "BPF_NOEXIST", value: 1)
!18 = !DIEnumerator(name: "BPF_EXIST", value: 2)
!19 = !DIEnumerator(name: "BPF_F_LOCK", value: 4)
!20 = !{!21, !58, !81, !109, !135, !140, !150, !152, !165, !170, !178, !180, !191, !193, !203, !205, !215, !217, !227, !229, !237, !239, !252, !257, !259, !264, !0, !280, !282, !284, !286, !288, !290, !292, !294, !296, !298, !300, !302, !304, !306, !308, !310, !318, !330, !338, !346, !358, !360, !362, !364, !366, !368, !370, !372, !374, !380, !387, !392, !402, !404, !409, !415, !422, !432, !438, !444, !446, !456, !459, !464}
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "outer_map_array", scope: !2, file: !3, line: 40, type: !23, isLocal: false, isDefinition: true)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 35, size: 192, elements: !24)
!24 = !{!25, !31, !36, !40}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !23, file: !3, line: 36, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 384, elements: !29)
!28 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!29 = !{!30}
!30 = !DISubrange(count: 12)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !23, file: !3, line: 37, baseType: !32, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 256, elements: !34)
!34 = !{!35}
!35 = !DISubrange(count: 8)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !23, file: !3, line: 38, baseType: !37, size: 64, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !39, line: 27, baseType: !7)
!39 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!40 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !23, file: !3, line: 39, baseType: !41, offset: 192)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, elements: !56)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inner_map_array", file: !3, line: 27, size: 256, elements: !44)
!44 = !{!45, !50, !51, !55}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !43, file: !3, line: 28, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 64, elements: !48)
!48 = !{!49}
!49 = !DISubrange(count: 2)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !43, file: !3, line: 29, baseType: !37, size: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !43, file: !3, line: 30, baseType: !52, size: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !39, line: 31, baseType: !54)
!54 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !43, file: !3, line: 31, baseType: !32, size: 64, offset: 192)
!56 = !{!57}
!57 = !DISubrange(count: -1)
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(name: "outer_map_queue", scope: !2, file: !3, line: 58, type: !60, isLocal: false, isDefinition: true)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 53, size: 192, elements: !61)
!61 = !{!62, !63, !64, !65}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !60, file: !3, line: 54, baseType: !26, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !60, file: !3, line: 55, baseType: !32, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !60, file: !3, line: 56, baseType: !37, size: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !60, file: !3, line: 57, baseType: !66, offset: 192)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, elements: !56)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inner_map_queue", file: !3, line: 45, size: 192, elements: !69)
!69 = !{!70, !75, !76}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !68, file: !3, line: 46, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 704, elements: !73)
!73 = !{!74}
!74 = !DISubrange(count: 22)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !68, file: !3, line: 47, baseType: !52, size: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !68, file: !3, line: 48, baseType: !77, size: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 1024, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 32)
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "outer_map_hash", scope: !2, file: !3, line: 125, type: !83, isLocal: false, isDefinition: true)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "outer_map_hash", file: !3, line: 120, size: 192, elements: !84)
!84 = !{!85, !90, !95, !96}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !83, file: !3, line: 121, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 416, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 13)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !83, file: !3, line: 122, baseType: !91, size: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_key", file: !3, line: 95, size: 32, elements: !93)
!93 = !{!94}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !92, file: !3, line: 96, baseType: !28, size: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !83, file: !3, line: 123, baseType: !32, size: 64, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !83, file: !3, line: 124, baseType: !97, offset: 192)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, elements: !56)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inner_array_hash", file: !3, line: 106, size: 256, elements: !100)
!100 = !{!101, !102, !103, !108}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !99, file: !3, line: 107, baseType: !46, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !99, file: !3, line: 108, baseType: !37, size: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !99, file: !3, line: 109, baseType: !104, size: 64, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "map_elem", file: !3, line: 91, size: 64, elements: !106)
!106 = !{!107}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !105, file: !3, line: 92, baseType: !53, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !99, file: !3, line: 110, baseType: !77, size: 64, offset: 192)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "____fmt", scope: !111, file: !3, line: 259, type: !130, isLocal: true, isDefinition: true)
!111 = distinct !DISubprogram(name: "common_array_lookup_diff_keys", scope: !3, file: !3, line: 253, type: !112, scopeLine: 254, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !123)
!112 = !DISubroutineType(types: !113)
!113 = !{!28, !114}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 5447, size: 192, elements: !116)
!116 = !{!117, !118, !119, !120, !121, !122}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !115, file: !6, line: 5448, baseType: !38, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !115, file: !6, line: 5449, baseType: !38, size: 32, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !115, file: !6, line: 5450, baseType: !38, size: 32, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !115, file: !6, line: 5452, baseType: !38, size: 32, offset: 96)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !115, file: !6, line: 5453, baseType: !38, size: 32, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "egress_ifindex", scope: !115, file: !6, line: 5455, baseType: !38, size: 32, offset: 160)
!123 = !{!124, !125, !126, !127, !129}
!124 = !DILocalVariable(name: "ctx", arg: 1, scope: !111, file: !3, line: 253, type: !114)
!125 = !DILocalVariable(name: "cpu", scope: !111, file: !3, line: 255, type: !28)
!126 = !DILocalVariable(name: "arrival_time", scope: !111, file: !3, line: 262, type: !53)
!127 = !DILocalVariable(name: "i", scope: !128, file: !3, line: 265, type: !28)
!128 = distinct !DILexicalBlock(scope: !111, file: !3, line: 265, column: 5)
!129 = !DILocalVariable(name: "finish_time", scope: !111, file: !3, line: 268, type: !53)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 280, elements: !133)
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!132 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!133 = !{!134}
!134 = !DISubrange(count: 35)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(name: "____fmt", scope: !111, file: !3, line: 270, type: !137, isLocal: true, isDefinition: true)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 264, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 33)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "____fmt", scope: !142, file: !3, line: 286, type: !130, isLocal: true, isDefinition: true)
!142 = distinct !DISubprogram(name: "percpu_array_lookup", scope: !3, file: !3, line: 280, type: !112, scopeLine: 281, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !143)
!143 = !{!144, !145, !146, !147, !149}
!144 = !DILocalVariable(name: "ctx", arg: 1, scope: !142, file: !3, line: 280, type: !114)
!145 = !DILocalVariable(name: "cpu", scope: !142, file: !3, line: 282, type: !28)
!146 = !DILocalVariable(name: "arrival_time", scope: !142, file: !3, line: 289, type: !53)
!147 = !DILocalVariable(name: "i", scope: !148, file: !3, line: 292, type: !28)
!148 = distinct !DILexicalBlock(scope: !142, file: !3, line: 292, column: 5)
!149 = !DILocalVariable(name: "finish_time", scope: !142, file: !3, line: 295, type: !53)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "____fmt", scope: !142, file: !3, line: 297, type: !137, isLocal: true, isDefinition: true)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "____fmt", scope: !154, file: !3, line: 310, type: !162, isLocal: true, isDefinition: true)
!154 = distinct !DISubprogram(name: "common_array_lookup_same_keys", scope: !3, file: !3, line: 304, type: !112, scopeLine: 305, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !155)
!155 = !{!156, !157, !158, !159, !161}
!156 = !DILocalVariable(name: "ctx", arg: 1, scope: !154, file: !3, line: 304, type: !114)
!157 = !DILocalVariable(name: "cpu", scope: !154, file: !3, line: 306, type: !28)
!158 = !DILocalVariable(name: "arrival_time", scope: !154, file: !3, line: 313, type: !53)
!159 = !DILocalVariable(name: "i", scope: !160, file: !3, line: 316, type: !28)
!160 = distinct !DILexicalBlock(scope: !154, file: !3, line: 316, column: 5)
!161 = !DILocalVariable(name: "finish_time", scope: !154, file: !3, line: 319, type: !53)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 288, elements: !163)
!163 = !{!164}
!164 = !DISubrange(count: 36)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "____fmt", scope: !154, file: !3, line: 321, type: !167, isLocal: true, isDefinition: true)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 272, elements: !168)
!168 = !{!169}
!169 = !DISubrange(count: 34)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "____fmt", scope: !172, file: !3, line: 340, type: !162, isLocal: true, isDefinition: true)
!172 = distinct !DISubprogram(name: "simply_drop", scope: !3, file: !3, line: 329, type: !112, scopeLine: 330, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !173)
!173 = !{!174, !175, !176, !177}
!174 = !DILocalVariable(name: "ctx", arg: 1, scope: !172, file: !3, line: 329, type: !114)
!175 = !DILocalVariable(name: "cpu", scope: !172, file: !3, line: 332, type: !28)
!176 = !DILocalVariable(name: "arrival_time", scope: !172, file: !3, line: 345, type: !53)
!177 = !DILocalVariable(name: "finish_time", scope: !172, file: !3, line: 371, type: !53)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(name: "____fmt", scope: !172, file: !3, line: 373, type: !167, isLocal: true, isDefinition: true)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "____fmt", scope: !182, file: !3, line: 441, type: !162, isLocal: true, isDefinition: true)
!182 = distinct !DISubprogram(name: "map_of_maps_queue", scope: !3, file: !3, line: 434, type: !112, scopeLine: 435, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !183)
!183 = !{!184, !185, !186, !187, !188, !190}
!184 = !DILocalVariable(name: "ctx", arg: 1, scope: !182, file: !3, line: 434, type: !114)
!185 = !DILocalVariable(name: "cpu", scope: !182, file: !3, line: 436, type: !28)
!186 = !DILocalVariable(name: "counter", scope: !182, file: !3, line: 439, type: !53)
!187 = !DILocalVariable(name: "arrival_time", scope: !182, file: !3, line: 444, type: !53)
!188 = !DILocalVariable(name: "i", scope: !189, file: !3, line: 446, type: !28)
!189 = distinct !DILexicalBlock(scope: !182, file: !3, line: 446, column: 5)
!190 = !DILocalVariable(name: "finish_time", scope: !182, file: !3, line: 449, type: !53)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(name: "____fmt", scope: !182, file: !3, line: 451, type: !167, isLocal: true, isDefinition: true)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "____fmt", scope: !195, file: !3, line: 485, type: !162, isLocal: true, isDefinition: true)
!195 = distinct !DISubprogram(name: "map_of_maps_array", scope: !3, file: !3, line: 480, type: !112, scopeLine: 481, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !196)
!196 = !{!197, !198, !199, !200, !202}
!197 = !DILocalVariable(name: "ctx", arg: 1, scope: !195, file: !3, line: 480, type: !114)
!198 = !DILocalVariable(name: "cpu", scope: !195, file: !3, line: 482, type: !28)
!199 = !DILocalVariable(name: "arrival_time", scope: !195, file: !3, line: 488, type: !53)
!200 = !DILocalVariable(name: "i", scope: !201, file: !3, line: 490, type: !28)
!201 = distinct !DILexicalBlock(scope: !195, file: !3, line: 490, column: 5)
!202 = !DILocalVariable(name: "finish_time", scope: !195, file: !3, line: 493, type: !53)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "____fmt", scope: !195, file: !3, line: 495, type: !167, isLocal: true, isDefinition: true)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "____fmt", scope: !207, file: !3, line: 514, type: !162, isLocal: true, isDefinition: true)
!207 = distinct !DISubprogram(name: "gets_cpu_id", scope: !3, file: !3, line: 502, type: !112, scopeLine: 503, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !208)
!208 = !{!209, !210, !211, !212, !214}
!209 = !DILocalVariable(name: "ctx", arg: 1, scope: !207, file: !3, line: 502, type: !114)
!210 = !DILocalVariable(name: "cpu", scope: !207, file: !3, line: 504, type: !28)
!211 = !DILocalVariable(name: "arrival_time", scope: !207, file: !3, line: 506, type: !53)
!212 = !DILocalVariable(name: "i", scope: !213, file: !3, line: 508, type: !28)
!213 = distinct !DILexicalBlock(scope: !207, file: !3, line: 508, column: 5)
!214 = !DILocalVariable(name: "finish_time", scope: !207, file: !3, line: 511, type: !53)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(name: "____fmt", scope: !207, file: !3, line: 518, type: !167, isLocal: true, isDefinition: true)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "____fmt", scope: !219, file: !3, line: 553, type: !162, isLocal: true, isDefinition: true)
!219 = distinct !DISubprogram(name: "lock_map", scope: !3, file: !3, line: 547, type: !112, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !220)
!220 = !{!221, !222, !223, !224, !226}
!221 = !DILocalVariable(name: "ctx", arg: 1, scope: !219, file: !3, line: 547, type: !114)
!222 = !DILocalVariable(name: "cpu", scope: !219, file: !3, line: 549, type: !28)
!223 = !DILocalVariable(name: "arrival_time", scope: !219, file: !3, line: 556, type: !53)
!224 = !DILocalVariable(name: "i", scope: !225, file: !3, line: 559, type: !28)
!225 = distinct !DILexicalBlock(scope: !219, file: !3, line: 559, column: 5)
!226 = !DILocalVariable(name: "finish_time", scope: !219, file: !3, line: 562, type: !53)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "____fmt", scope: !219, file: !3, line: 564, type: !167, isLocal: true, isDefinition: true)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "____fmt", scope: !231, file: !3, line: 613, type: !162, isLocal: true, isDefinition: true)
!231 = distinct !DISubprogram(name: "map_of_maps_hash", scope: !3, file: !3, line: 608, type: !112, scopeLine: 609, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !232)
!232 = !{!233, !234, !235, !236}
!233 = !DILocalVariable(name: "ctx", arg: 1, scope: !231, file: !3, line: 608, type: !114)
!234 = !DILocalVariable(name: "cpu", scope: !231, file: !3, line: 610, type: !53)
!235 = !DILocalVariable(name: "arrival_time", scope: !231, file: !3, line: 616, type: !53)
!236 = !DILocalVariable(name: "finish_time", scope: !231, file: !3, line: 621, type: !53)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "____fmt", scope: !231, file: !3, line: 623, type: !167, isLocal: true, isDefinition: true)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "____fmt", scope: !241, file: !3, line: 636, type: !130, isLocal: true, isDefinition: true)
!241 = distinct !DISubprogram(name: "common_hash_map", scope: !3, file: !3, line: 630, type: !112, scopeLine: 631, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !242)
!242 = !{!243, !244, !245, !246, !247, !248, !251}
!243 = !DILocalVariable(name: "ctx", arg: 1, scope: !241, file: !3, line: 630, type: !114)
!244 = !DILocalVariable(name: "cpu", scope: !241, file: !3, line: 632, type: !28)
!245 = !DILocalVariable(name: "arrival_time", scope: !241, file: !3, line: 639, type: !53)
!246 = !DILocalVariable(name: "hash_map_key", scope: !241, file: !3, line: 643, type: !92)
!247 = !DILocalVariable(name: "elem", scope: !241, file: !3, line: 644, type: !104)
!248 = !DILocalVariable(name: "new_value", scope: !249, file: !3, line: 646, type: !53)
!249 = distinct !DILexicalBlock(scope: !250, file: !3, line: 645, column: 19)
!250 = distinct !DILexicalBlock(scope: !241, file: !3, line: 645, column: 12)
!251 = !DILocalVariable(name: "finish_time", scope: !241, file: !3, line: 658, type: !53)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "____fmt", scope: !241, file: !3, line: 651, type: !254, isLocal: true, isDefinition: true)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 320, elements: !255)
!255 = !{!256}
!256 = !DISubrange(count: 40)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "____fmt", scope: !241, file: !3, line: 660, type: !137, isLocal: true, isDefinition: true)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 668, type: !261, isLocal: false, isDefinition: true)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 32, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 4)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "lock_array", scope: !2, file: !3, line: 25, type: !266, isLocal: false, isDefinition: true)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 20, size: 256, elements: !267)
!267 = !{!268, !269, !270, !279}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !266, file: !3, line: 21, baseType: !46, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !266, file: !3, line: 22, baseType: !37, size: 64, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !266, file: !3, line: 23, baseType: !271, size: 64, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "map_locked_value", file: !3, line: 15, size: 128, elements: !273)
!273 = !{!274, !275}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !272, file: !3, line: 16, baseType: !53, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !272, file: !3, line: 17, baseType: !276, size: 32, offset: 64)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_spin_lock", file: !6, line: 6186, size: 32, elements: !277)
!277 = !{!278}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !276, file: !6, line: 6187, baseType: !38, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !266, file: !3, line: 24, baseType: !32, size: 64, offset: 192)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "inner_map_array1", scope: !2, file: !3, line: 32, type: !43, isLocal: false, isDefinition: true)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "inner_map_array2", scope: !2, file: !3, line: 32, type: !43, isLocal: false, isDefinition: true)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "inner_map_array3", scope: !2, file: !3, line: 32, type: !43, isLocal: false, isDefinition: true)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "inner_map_array4", scope: !2, file: !3, line: 33, type: !43, isLocal: false, isDefinition: true)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "inner_map_array5", scope: !2, file: !3, line: 33, type: !43, isLocal: false, isDefinition: true)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "inner_map_array6", scope: !2, file: !3, line: 33, type: !43, isLocal: false, isDefinition: true)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "inner_map_array7", scope: !2, file: !3, line: 33, type: !43, isLocal: false, isDefinition: true)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "inner_map_queue0", scope: !2, file: !3, line: 49, type: !68, isLocal: false, isDefinition: true)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "inner_map_queue1", scope: !2, file: !3, line: 49, type: !68, isLocal: false, isDefinition: true)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "inner_map_queue2", scope: !2, file: !3, line: 49, type: !68, isLocal: false, isDefinition: true)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "inner_map_queue3", scope: !2, file: !3, line: 49, type: !68, isLocal: false, isDefinition: true)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "inner_map_queue4", scope: !2, file: !3, line: 50, type: !68, isLocal: false, isDefinition: true)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "inner_map_queue5", scope: !2, file: !3, line: 50, type: !68, isLocal: false, isDefinition: true)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "inner_map_queue6", scope: !2, file: !3, line: 50, type: !68, isLocal: false, isDefinition: true)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "inner_map_queue7", scope: !2, file: !3, line: 50, type: !68, isLocal: false, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "common_array", scope: !2, file: !3, line: 68, type: !312, isLocal: false, isDefinition: true)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 63, size: 256, elements: !313)
!313 = !{!314, !315, !316, !317}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !312, file: !3, line: 64, baseType: !46, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !312, file: !3, line: 65, baseType: !37, size: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !312, file: !3, line: 66, baseType: !52, size: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !312, file: !3, line: 67, baseType: !32, size: 64, offset: 192)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "percpu_array", scope: !2, file: !3, line: 75, type: !320, isLocal: false, isDefinition: true)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 70, size: 256, elements: !321)
!321 = !{!322, !327, !328, !329}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !320, file: !3, line: 71, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 192, elements: !325)
!325 = !{!326}
!326 = !DISubrange(count: 6)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !320, file: !3, line: 72, baseType: !37, size: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !320, file: !3, line: 73, baseType: !52, size: 64, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !320, file: !3, line: 74, baseType: !32, size: 64, offset: 192)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "counter_array", scope: !2, file: !3, line: 82, type: !332, isLocal: false, isDefinition: true)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 77, size: 256, elements: !333)
!333 = !{!334, !335, !336, !337}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !332, file: !3, line: 78, baseType: !46, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !332, file: !3, line: 79, baseType: !37, size: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !332, file: !3, line: 80, baseType: !52, size: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !332, file: !3, line: 81, baseType: !32, size: 64, offset: 192)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "time_array", scope: !2, file: !3, line: 89, type: !340, isLocal: false, isDefinition: true)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 84, size: 256, elements: !341)
!341 = !{!342, !343, !344, !345}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !340, file: !3, line: 85, baseType: !46, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !340, file: !3, line: 86, baseType: !37, size: 64, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !340, file: !3, line: 87, baseType: !52, size: 64, offset: 128)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !340, file: !3, line: 88, baseType: !32, size: 64, offset: 192)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "common_hash", scope: !2, file: !3, line: 104, type: !348, isLocal: false, isDefinition: true)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 99, size: 256, elements: !349)
!349 = !{!350, !355, !356, !357}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !348, file: !3, line: 100, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 32, elements: !353)
!353 = !{!354}
!354 = !DISubrange(count: 1)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !348, file: !3, line: 101, baseType: !91, size: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !348, file: !3, line: 102, baseType: !52, size: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !348, file: !3, line: 103, baseType: !32, size: 64, offset: 192)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "inner_array_hash0", scope: !2, file: !3, line: 111, type: !99, isLocal: false, isDefinition: true)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "inner_array_hash1", scope: !2, file: !3, line: 112, type: !99, isLocal: false, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "inner_array_hash2", scope: !2, file: !3, line: 113, type: !99, isLocal: false, isDefinition: true)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "inner_array_hash3", scope: !2, file: !3, line: 114, type: !99, isLocal: false, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "inner_array_hash4", scope: !2, file: !3, line: 115, type: !99, isLocal: false, isDefinition: true)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "inner_array_hash5", scope: !2, file: !3, line: 116, type: !99, isLocal: false, isDefinition: true)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "inner_array_hash6", scope: !2, file: !3, line: 117, type: !99, isLocal: false, isDefinition: true)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "inner_array_hash7", scope: !2, file: !3, line: 118, type: !99, isLocal: false, isDefinition: true)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "bpf_get_smp_processor_id", scope: !2, file: !376, line: 206, type: !377, isLocal: true, isDefinition: true)
!376 = !DIFile(filename: "../lib/install/include/bpf/bpf_helper_defs.h", directory: "/home/pvvalenc/benchmark/benchmark_XDP_map/xdp/benchmark", checksumkind: CSK_MD5, checksum: "7422ca06c9dc86eba2f268a57d8acf2f")
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DISubroutineType(types: !379)
!379 = !{!38}
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !376, line: 177, type: !382, isLocal: true, isDefinition: true)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DISubroutineType(types: !384)
!384 = !{!385, !386, !38, null}
!385 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "bpf_ktime_get_ns", scope: !2, file: !376, line: 114, type: !389, isLocal: true, isDefinition: true)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!53}
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "____fmt", scope: !394, file: !3, line: 384, type: !130, isLocal: true, isDefinition: true)
!394 = distinct !DISubprogram(name: "lookup_map_of_maps_queue", scope: !3, file: !3, line: 379, type: !395, scopeLine: 379, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !397)
!395 = !DISubroutineType(types: !396)
!396 = !{!53, !28, !53}
!397 = !{!398, !399, !400, !401}
!398 = !DILocalVariable(name: "key", arg: 1, scope: !394, file: !3, line: 379, type: !28)
!399 = !DILocalVariable(name: "counter", arg: 2, scope: !394, file: !3, line: 379, type: !53)
