; ModuleID = 'kernel_xdp.c'
source_filename = "kernel_xdp.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.inner_app_array = type { [2 x i32]*, i32*, %struct.app_event*, [1000 x i32]* }
%struct.app_event = type { i32, i32, i32, i32, i8, i32, i32, i8, i32, i8, i32, i32, i64 }
%struct.inner_timer_array = type { [2 x i32]*, i32*, %struct.timer_event*, [1000 x i32]* }
%struct.timer_event = type { i32, i32, i32, i64 }
%struct.inner_prog_array = type { [2 x i32]*, i32*, %struct.prog_event*, [1000 x i32]* }
%struct.prog_event = type { i32, i32, i32, i32, i32, i8, i8, i32 }
%struct.anon = type { [17 x i32]*, i32*, i32*, [1 x i32]* }
%struct.anon.0 = type { [2 x i32]*, i32*, %struct.info*, [1 x i32]* }
%struct.info = type { i64, i64 }
%struct.anon.1 = type { [2 x i32]*, i32*, i32*, [2001 x i32]* }
%struct.flow_id_hash = type { [1 x i32]*, %struct.flow_id*, i32*, [2001 x i32]* }
%struct.flow_id = type { i32, i32, i16, i16 }
%struct.anon.2 = type { [2 x i32]*, i32*, %struct.queue_flow_info*, [2001 x i32]* }
%struct.queue_flow_info = type { %struct.app_info, %struct.timer_info, %struct.prog_info }
%struct.app_info = type { i32, i32, i32 }
%struct.timer_info = type { i64, i32, i32, i64 }
%struct.prog_info = type { i32, i32, i32 }
%struct.anon.3 = type { [1 x i32]*, %struct.timer_trigger_id*, %struct.timer_trigger*, [20010 x i32]* }
%struct.timer_trigger_id = type { i32, i32 }

!6 = !DIFile(filename: "./common_def.h", directory: "/home/rcsguest/XDP-Tryouts/xdp/rocev2", checksumkind: CSK_MD5, checksum: "591bb3137188c1f938bd482a2089114c")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29}
!9 = !DIEnumerator(name: "SEND_WQE", value: 1)
!10 = !DIEnumerator(name: "WRITE_WQE", value: 2)
!11 = !DIEnumerator(name: "RECV_WQE", value: 3)
!12 = !DIEnumerator(name: "READ_WQE", value: 4)
!13 = !DIEnumerator(name: "ATOMIC_WQE", value: 5)
!14 = !DIEnumerator(name: "TRANSMIT_EVENT", value: 6)
!15 = !DIEnumerator(name: "RECV_DATA", value: 7)
!16 = !DIEnumerator(name: "WRITE_DATA", value: 8)
!17 = !DIEnumerator(name: "READ_REQ_DATA", value: 9)
!18 = !DIEnumerator(name: "READ_RESP_DATA", value: 10)
!19 = !DIEnumerator(name: "ATOMIC_DATA", value: 11)
!20 = !DIEnumerator(name: "ATOMIC_ACK", value: 12)
!21 = !DIEnumerator(name: "RESPONDER_EVENT", value: 13)
!22 = !DIEnumerator(name: "ACK", value: 14)
!23 = !DIEnumerator(name: "NACK", value: 15)
!24 = !DIEnumerator(name: "CNP_CHECK", value: 16)
!25 = !DIEnumerator(name: "CNP", value: 17)
!26 = !DIEnumerator(name: "DCQCN_TIMER", value: 18)
!27 = !DIEnumerator(name: "DCQCN_INCREASE", value: 19)
!28 = !DIEnumerator(name: "ALPHA_CHECK", value: 20)
!29 = !DIEnumerator(name: "MISS_ACK", value: 21)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !31, line: 5450, baseType: !7, size: 32, elements: !32)
!31 = !DIFile(filename: "/usr/include/linux/bpf.h", directory: "", checksumkind: CSK_MD5, checksum: "9ae8d3e7794aed0db7a0a2345ab881ee")
!32 = !{!33, !34, !35, !36, !37}
!33 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!34 = !DIEnumerator(name: "XDP_DROP", value: 1)
!35 = !DIEnumerator(name: "XDP_PASS", value: 2)
!36 = !DIEnumerator(name: "XDP_TX", value: 3)
!37 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !39, line: 28, baseType: !7, size: 32, elements: !40)
!39 = !DIFile(filename: "/usr/include/linux/in.h", directory: "", checksumkind: CSK_MD5, checksum: "078a32220dc819f6a7e2ea3cecc4e133")
!40 = !{!41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68}
!41 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!42 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!43 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!44 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!45 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!46 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!47 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!48 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!49 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!50 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!51 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!52 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!53 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!54 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!55 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!56 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!57 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!58 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!59 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!60 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!61 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!62 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!63 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!64 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!65 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143)
!66 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!67 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262)
!68 = !DIEnumerator(name: "IPPROTO_MAX", value: 263)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "timer_id", file: !6, line: 437, baseType: !7, size: 32, elements: !70)
!70 = !{!71, !72, !73, !74}
!71 = !DIEnumerator(name: "timer_ack_timeout", value: 0)
!72 = !DIEnumerator(name: "timer_cnp", value: 1)
!73 = !DIEnumerator(name: "timer_alpha", value: 2)
!74 = !DIEnumerator(name: "timer_DCQCN_counter", value: 3)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 1168, baseType: !7, size: 32, elements: !76)
!76 = !{!77, !78, !79, !80}
!77 = !DIEnumerator(name: "BPF_ANY", value: 0)
!78 = !DIEnumerator(name: "BPF_NOEXIST", value: 1)
!79 = !DIEnumerator(name: "BPF_EXIST", value: 2)
!80 = !DIEnumerator(name: "BPF_F_LOCK", value: 4)
!81 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "major_event_type", file: !6, line: 21, baseType: !7, size: 32, elements: !82)
!82 = !{!83, !84, !85}
!83 = !DIEnumerator(name: "APP_EVENT", value: 0)
!84 = !DIEnumerator(name: "TIMER_EVENT", value: 1)
!85 = !DIEnumerator(name: "PROG_EVENT", value: 2)
!86 = !{!87, !88, !89, !92, !113, !124}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!88 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !90, line: 24, baseType: !91)
!90 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!91 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "metadata_hdr", file: !6, line: 62, size: 256, elements: !94)
!94 = !{!95, !101, !102, !106, !107, !109, !110, !111, !112}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "src_mac", scope: !93, file: !6, line: 63, baseType: !96, size: 48)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 48, elements: !99)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !90, line: 21, baseType: !98)
!98 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!99 = !{!100}
!100 = !DISubrange(count: 6)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "dst_mac", scope: !93, file: !6, line: 64, baseType: !96, size: 48, offset: 48)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip", scope: !93, file: !6, line: 65, baseType: !103, size: 32, offset: 96)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !104, line: 27, baseType: !105)
!104 = !DIFile(filename: "/usr/include/linux/types.h", directory: "", checksumkind: CSK_MD5, checksum: "52ec79a38e49ac7d1dc9e146ba88a7b1")
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !90, line: 27, baseType: !7)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip", scope: !93, file: !6, line: 66, baseType: !103, size: 32, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "src_port", scope: !93, file: !6, line: 67, baseType: !108, size: 16, offset: 160)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !104, line: 25, baseType: !89)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "dst_port", scope: !93, file: !6, line: 68, baseType: !108, size: 16, offset: 176)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !93, file: !6, line: 69, baseType: !89, size: 16, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "metadata_end", scope: !93, file: !6, line: 70, baseType: !89, size: 16, offset: 208)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "cwnd_size", scope: !93, file: !6, line: 71, baseType: !105, size: 32, offset: 224)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prog_event", file: !6, line: 216, size: 224, elements: !115)
!115 = !{!116, !117, !118, !119, !120, !121, !122, !123}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !114, file: !6, line: 218, baseType: !5, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "ev_flow_id", scope: !114, file: !6, line: 219, baseType: !105, size: 32, offset: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "qp_id", scope: !114, file: !6, line: 220, baseType: !105, size: 32, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "wr_id", scope: !114, file: !6, line: 221, baseType: !105, size: 32, offset: 96)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "psn", scope: !114, file: !6, line: 222, baseType: !105, size: 32, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "ack_req", scope: !114, file: !6, line: 223, baseType: !97, size: 8, offset: 160)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !114, file: !6, line: 224, baseType: !97, size: 8, offset: 168)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !114, file: !6, line: 225, baseType: !105, size: 32, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timer_event", file: !6, line: 209, size: 192, elements: !126)
!126 = !{!127, !128, !129, !130}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !125, file: !6, line: 211, baseType: !5, size: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "ev_flow_id", scope: !125, file: !6, line: 212, baseType: !105, size: 32, offset: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "qp_id", scope: !125, file: !6, line: 213, baseType: !105, size: 32, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "valid_bit", scope: !125, file: !6, line: 214, baseType: !131, size: 64, offset: 128)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !90, line: 31, baseType: !132)
!132 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!133 = !{!134, !186, !202, !218, !224, !241, !0, !253, !261, !263, !265, !280, !310, !335, !454, !502, !575, !577, !588, !594, !596, !607, !613, !619, !633, !638, !643, !659, !666, !671, !676, !695, !700, !702, !704, !709, !743, !772, !785, !790, !805, !807, !809, !839, !860, !880, !894, !896, !898, !900, !911, !916, !927, !929, !931, !956, !961}
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "outer_app_array", scope: !2, file: !3, line: 62, type: !136, isLocal: false, isDefinition: true)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "outer_app_hash", file: !3, line: 57, size: 192, elements: !137)
!137 = !{!138, !144, !146, !151}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !136, file: !3, line: 58, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 384, elements: !142)
!141 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!142 = !{!143}
!143 = !DISubrange(count: 12)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !136, file: !3, line: 59, baseType: !145, size: 64, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !136, file: !3, line: 60, baseType: !147, size: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 64032, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 2001)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !136, file: !3, line: 61, baseType: !152, offset: 192)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, elements: !184)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inner_app_array", file: !3, line: 50, size: 256, elements: !155)
!155 = !{!156, !161, !162, !179}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !154, file: !3, line: 51, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 64, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 2)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !154, file: !3, line: 52, baseType: !145, size: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !154, file: !3, line: 53, baseType: !163, size: 64, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "app_event", file: !6, line: 170, size: 448, elements: !165)
!165 = !{!166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !164, file: !6, line: 172, baseType: !5, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "ev_flow_id", scope: !164, file: !6, line: 173, baseType: !105, size: 32, offset: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "wr_id", scope: !164, file: !6, line: 174, baseType: !105, size: 32, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "lkey", scope: !164, file: !6, line: 175, baseType: !105, size: 32, offset: 96)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !164, file: !6, line: 176, baseType: !97, size: 8, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !164, file: !6, line: 177, baseType: !105, size: 32, offset: 160)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "qp_id", scope: !164, file: !6, line: 178, baseType: !105, size: 32, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ack_req", scope: !164, file: !6, line: 179, baseType: !97, size: 8, offset: 224)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "rkey", scope: !164, file: !6, line: 180, baseType: !105, size: 32, offset: 256)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "raddr", scope: !164, file: !6, line: 181, baseType: !97, size: 8, offset: 288)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "swap_add", scope: !164, file: !6, line: 182, baseType: !105, size: 32, offset: 320)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "compare", scope: !164, file: !6, line: 183, baseType: !105, size: 32, offset: 352)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "occupied", scope: !164, file: !6, line: 184, baseType: !131, size: 64, offset: 384)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !154, file: !3, line: 54, baseType: !180, size: 64, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 32000, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 1000)
!184 = !{!185}
!185 = !DISubrange(count: -1)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "outer_timer_array", scope: !2, file: !3, line: 87, type: !188, isLocal: false, isDefinition: true)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "outer_timer_hash", file: !3, line: 82, size: 192, elements: !189)
!189 = !{!190, !191, !192, !193}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !188, file: !3, line: 83, baseType: !139, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !188, file: !3, line: 84, baseType: !145, size: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !188, file: !3, line: 85, baseType: !147, size: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !188, file: !3, line: 86, baseType: !194, offset: 192)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, elements: !184)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inner_timer_array", file: !3, line: 75, size: 256, elements: !197)
!197 = !{!198, !199, !200, !201}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !196, file: !3, line: 76, baseType: !157, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !196, file: !3, line: 77, baseType: !145, size: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !196, file: !3, line: 78, baseType: !124, size: 64, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !196, file: !3, line: 79, baseType: !180, size: 64, offset: 192)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "outer_prog_array", scope: !2, file: !3, line: 106, type: !204, isLocal: false, isDefinition: true)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "outer_prog_hash", file: !3, line: 101, size: 192, elements: !205)
!205 = !{!206, !207, !208, !209}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !204, file: !3, line: 102, baseType: !139, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !204, file: !3, line: 103, baseType: !145, size: 64, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !204, file: !3, line: 104, baseType: !147, size: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !204, file: !3, line: 105, baseType: !210, offset: 192)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, elements: !184)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inner_prog_array", file: !3, line: 94, size: 256, elements: !213)
!213 = !{!214, !215, !216, !217}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !212, file: !3, line: 95, baseType: !157, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !212, file: !3, line: 96, baseType: !145, size: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !212, file: !3, line: 97, baseType: !113, size: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !212, file: !3, line: 98, baseType: !180, size: 64, offset: 192)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 2809, type: !220, isLocal: false, isDefinition: true)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 32, elements: !222)
!221 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!222 = !{!223}
!223 = !DISubrange(count: 4)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(name: "info_array", scope: !2, file: !3, line: 36, type: !226, isLocal: false, isDefinition: true)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 31, size: 256, elements: !227)
!227 = !{!228, !229, !230, !236}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !226, file: !3, line: 32, baseType: !157, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !226, file: !3, line: 33, baseType: !145, size: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !226, file: !3, line: 34, baseType: !231, size: 64, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "info", file: !3, line: 26, size: 128, elements: !233)
!233 = !{!234, !235}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "latency", scope: !232, file: !3, line: 27, baseType: !131, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !232, file: !3, line: 28, baseType: !131, size: 64, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !226, file: !3, line: 35, baseType: !237, size: 64, offset: 192)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 32, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 1)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(name: "xsks_map", scope: !2, file: !3, line: 46, type: !243, isLocal: false, isDefinition: true)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 41, size: 256, elements: !244)
!244 = !{!245, !250, !251, !252}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !243, file: !3, line: 42, baseType: !246, size: 64)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 544, elements: !248)
!248 = !{!249}
!249 = !DISubrange(count: 17)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !243, file: !3, line: 43, baseType: !145, size: 64, offset: 64)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !243, file: !3, line: 44, baseType: !145, size: 64, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !243, file: !3, line: 45, baseType: !237, size: 64, offset: 192)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "tail_app_array", scope: !2, file: !3, line: 71, type: !255, isLocal: false, isDefinition: true)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 66, size: 256, elements: !256)
!256 = !{!257, !258, !259, !260}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !255, file: !3, line: 67, baseType: !157, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !255, file: !3, line: 68, baseType: !145, size: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !255, file: !3, line: 69, baseType: !145, size: 64, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !255, file: !3, line: 70, baseType: !147, size: 64, offset: 192)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "inner_timer_array", scope: !2, file: !3, line: 80, type: !196, isLocal: false, isDefinition: true)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "inner_prog_array", scope: !2, file: !3, line: 99, type: !212, isLocal: false, isDefinition: true)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "flow_id_hash", scope: !2, file: !3, line: 117, type: !267, isLocal: false, isDefinition: true)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flow_id_hash", file: !3, line: 112, size: 256, elements: !268)
!268 = !{!269, !270, !278, !279}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !267, file: !3, line: 113, baseType: !237, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !267, file: !3, line: 114, baseType: !271, size: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flow_id", file: !6, line: 27, size: 96, elements: !273)
!273 = !{!274, !275, !276, !277}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip", scope: !272, file: !6, line: 28, baseType: !103, size: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "dest_ip", scope: !272, file: !6, line: 29, baseType: !103, size: 32, offset: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "src_port", scope: !272, file: !6, line: 30, baseType: !108, size: 16, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "dest_port", scope: !272, file: !6, line: 31, baseType: !108, size: 16, offset: 80)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !267, file: !3, line: 115, baseType: !145, size: 64, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !267, file: !3, line: 116, baseType: !147, size: 64, offset: 192)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "queue_flow_info_array", scope: !2, file: !3, line: 126, type: !282, isLocal: false, isDefinition: true)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 121, size: 256, elements: !283)
!283 = !{!284, !285, !286, !309}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !282, file: !3, line: 122, baseType: !157, size: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !282, file: !3, line: 123, baseType: !145, size: 64, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !282, file: !3, line: 124, baseType: !287, size: 64, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "queue_flow_info", file: !6, line: 43, size: 448, elements: !289)
!289 = !{!290, !296, !303}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "app_info", scope: !288, file: !6, line: 48, baseType: !291, size: 96)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "app_info", file: !6, line: 44, size: 96, elements: !292)
!292 = !{!293, !294, !295}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "app_head", scope: !291, file: !6, line: 45, baseType: !105, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "app_tail", scope: !291, file: !6, line: 46, baseType: !105, size: 32, offset: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "len_app_queue", scope: !291, file: !6, line: 47, baseType: !105, size: 32, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "timer_info", scope: !288, file: !6, line: 54, baseType: !297, size: 192, offset: 128)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timer_info", file: !6, line: 49, size: 192, elements: !298)
!298 = !{!299, !300, !301, !302}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "len_timer_queue", scope: !297, file: !6, line: 50, baseType: !131, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "timer_head", scope: !297, file: !6, line: 51, baseType: !105, size: 32, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "timer_tail", scope: !297, file: !6, line: 52, baseType: !105, size: 32, offset: 96)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "executing_enqueue", scope: !297, file: !6, line: 53, baseType: !131, size: 64, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "prog_info", scope: !288, file: !6, line: 59, baseType: !304, size: 96, offset: 320)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prog_info", file: !6, line: 55, size: 96, elements: !305)
!305 = !{!306, !307, !308}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "len_prog_queue", scope: !304, file: !6, line: 56, baseType: !105, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "prog_head", scope: !304, file: !6, line: 57, baseType: !105, size: 32, offset: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "prog_tail", scope: !304, file: !6, line: 58, baseType: !105, size: 32, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !282, file: !3, line: 125, baseType: !147, size: 64, offset: 192)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "timer_trigger_hash", scope: !2, file: !3, line: 135, type: !312, isLocal: false, isDefinition: true)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 130, size: 256, elements: !313)
!313 = !{!314, !315, !321, !330}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !312, file: !3, line: 131, baseType: !237, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !312, file: !3, line: 132, baseType: !316, size: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timer_trigger_id", file: !6, line: 449, size: 64, elements: !318)
!318 = !{!319, !320}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "f_id", scope: !317, file: !6, line: 450, baseType: !105, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "timer_id", scope: !317, file: !6, line: 451, baseType: !105, size: 32, offset: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !312, file: !3, line: 133, baseType: !322, size: 64, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timer_trigger", file: !6, line: 443, size: 384, elements: !324)
!324 = !{!325, !328, !329}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !323, file: !6, line: 444, baseType: !326, size: 128, align: 64)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_timer", file: !31, line: 6221, size: 128, align: 64, elements: !327)
!327 = !{}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "t_event", scope: !323, file: !6, line: 445, baseType: !125, size: 192, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "triggered", scope: !323, file: !6, line: 446, baseType: !105, size: 32, offset: 320)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !312, file: !3, line: 134, baseType: !331, size: 64, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 640320, elements: !333)
!333 = !{!334}
!334 = !DISubrange(count: 20010)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "context_array", scope: !2, file: !3, line: 145, type: !337, isLocal: false, isDefinition: true)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 140, size: 256, elements: !338)
!338 = !{!339, !340, !341, !453}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !337, file: !3, line: 141, baseType: !157, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !337, file: !3, line: 142, baseType: !145, size: 64, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !337, file: !3, line: 143, baseType: !342, size: 64, offset: 128)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "context", file: !6, line: 277, size: 1365248, elements: !344)
!344 = !{!345, !346, !347, !351, !352, !353, !354, !412, !413, !414, !415, !417, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !450, !451, !452}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "qp_id", scope: !343, file: !6, line: 279, baseType: !105, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "lkey", scope: !343, file: !6, line: 280, baseType: !105, size: 32, offset: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "SQ_list", scope: !343, file: !6, line: 281, baseType: !348, size: 224000, offset: 64)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 224000, elements: !349)
!349 = !{!350}
!350 = !DISubrange(count: 500)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "num_SQ_list", scope: !343, file: !6, line: 282, baseType: !105, size: 32, offset: 224064)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "RQ_list", scope: !343, file: !6, line: 283, baseType: !348, size: 224000, offset: 224128)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "num_RQ_list", scope: !343, file: !6, line: 284, baseType: !105, size: 32, offset: 448128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "sent_packets", scope: !343, file: !6, line: 285, baseType: !355, size: 496000, offset: 448160)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, size: 496000, elements: !349)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "packet_info", file: !6, line: 254, size: 992, elements: !357)
!357 = !{!358, !406, !407, !408, !409, !410, !411}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_ev", scope: !356, file: !6, line: 256, baseType: !359, size: 800)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_metadata", file: !6, line: 239, size: 800, elements: !360)
!360 = !{!361, !362, !363, !370, !377, !383, !391, !398, !402, !403, !404, !405}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "type_metadata", scope: !359, file: !6, line: 241, baseType: !97, size: 8)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "hdr_combination", scope: !359, file: !6, line: 242, baseType: !105, size: 32, offset: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "udp", scope: !359, file: !6, line: 243, baseType: !364, size: 128, offset: 64)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UDPHeader", file: !6, line: 163, size: 128, elements: !365)
!365 = !{!366, !367, !368, !369}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "src_port", scope: !364, file: !6, line: 165, baseType: !105, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "dst_port", scope: !364, file: !6, line: 166, baseType: !105, size: 32, offset: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !364, file: !6, line: 167, baseType: !105, size: 32, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !364, file: !6, line: 168, baseType: !105, size: 32, offset: 96)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "bth", scope: !359, file: !6, line: 244, baseType: !371, size: 128, offset: 192)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BTHeader", file: !6, line: 139, size: 128, elements: !372)
!372 = !{!373, !374, !375, !376}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !371, file: !6, line: 141, baseType: !105, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "ack_req", scope: !371, file: !6, line: 142, baseType: !97, size: 8, offset: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "dest_qp", scope: !371, file: !6, line: 143, baseType: !105, size: 32, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "psn", scope: !371, file: !6, line: 144, baseType: !105, size: 32, offset: 96)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "reth", scope: !359, file: !6, line: 245, baseType: !378, size: 96, offset: 320)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RETHeader", file: !6, line: 157, size: 96, elements: !379)
!379 = !{!380, !381, !382}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "raddr", scope: !378, file: !6, line: 159, baseType: !105, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "rkey", scope: !378, file: !6, line: 160, baseType: !105, size: 32, offset: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !378, file: !6, line: 161, baseType: !105, size: 32, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "aeth", scope: !359, file: !6, line: 246, baseType: !384, size: 128, offset: 416)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AETHeader", file: !6, line: 120, size: 128, elements: !385)
!385 = !{!386, !387, !388, !389, !390}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !384, file: !6, line: 122, baseType: !97, size: 8)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "type_nack", scope: !384, file: !6, line: 123, baseType: !97, size: 8, offset: 8)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "credit_count", scope: !384, file: !6, line: 124, baseType: !105, size: 32, offset: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "MSN", scope: !384, file: !6, line: 125, baseType: !105, size: 32, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "RNR_delay", scope: !384, file: !6, line: 126, baseType: !105, size: 32, offset: 96)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "atom_aeth", scope: !359, file: !6, line: 247, baseType: !392, size: 128, offset: 544)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicETHeader", file: !6, line: 132, size: 128, elements: !393)
!393 = !{!394, !395, !396, !397}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "raddr", scope: !392, file: !6, line: 134, baseType: !97, size: 8)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "rkey", scope: !392, file: !6, line: 135, baseType: !105, size: 32, offset: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "swap_add", scope: !392, file: !6, line: 136, baseType: !105, size: 32, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "compare", scope: !392, file: !6, line: 137, baseType: !105, size: 32, offset: 96)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "atom_ack_eth", scope: !359, file: !6, line: 248, baseType: !399, size: 32, offset: 672)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicAckETHeader", file: !6, line: 128, size: 32, elements: !400)
!400 = !{!401}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "original_data", scope: !399, file: !6, line: 130, baseType: !105, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "read_from_mem", scope: !359, file: !6, line: 249, baseType: !97, size: 8, offset: 704)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !359, file: !6, line: 250, baseType: !97, size: 8, offset: 712)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !359, file: !6, line: 251, baseType: !105, size: 32, offset: 736)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "Rc", scope: !359, file: !6, line: 252, baseType: !105, size: 32, offset: 768)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "psn", scope: !356, file: !6, line: 257, baseType: !105, size: 32, offset: 800)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "ack_req", scope: !356, file: !6, line: 258, baseType: !97, size: 8, offset: 832)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "wr_id", scope: !356, file: !6, line: 259, baseType: !105, size: 32, offset: 864)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "acked", scope: !356, file: !6, line: 260, baseType: !97, size: 8, offset: 896)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "SSN", scope: !356, file: !6, line: 261, baseType: !105, size: 32, offset: 928)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "laddr", scope: !356, file: !6, line: 262, baseType: !97, size: 8, offset: 960)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "num_sent_packets", scope: !343, file: !6, line: 286, baseType: !105, size: 32, offset: 944160)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "transport_timer", scope: !343, file: !6, line: 287, baseType: !105, size: 32, offset: 944192)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "nPSN", scope: !343, file: !6, line: 288, baseType: !105, size: 32, offset: 944224)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "CQ", scope: !343, file: !6, line: 289, baseType: !416, size: 4000, offset: 944256)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 4000, elements: !349)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "responder_packets", scope: !343, file: !6, line: 290, baseType: !418, size: 416000, offset: 948256)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !419, size: 416000, elements: !349)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "responder_packet_info", file: !6, line: 264, size: 832, elements: !420)
!420 = !{!421, !422}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_ev", scope: !419, file: !6, line: 266, baseType: !359, size: 800)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "wr_id", scope: !419, file: !6, line: 267, baseType: !105, size: 32, offset: 800)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "num_responder_packets", scope: !343, file: !6, line: 291, baseType: !105, size: 32, offset: 1364256)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "ePSN", scope: !343, file: !6, line: 292, baseType: !105, size: 32, offset: 1364288)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "MSN", scope: !343, file: !6, line: 293, baseType: !105, size: 32, offset: 1364320)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "credit_count", scope: !343, file: !6, line: 294, baseType: !105, size: 32, offset: 1364352)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "recv_first_psn", scope: !343, file: !6, line: 295, baseType: !105, size: 32, offset: 1364384)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "write_first_psn", scope: !343, file: !6, line: 296, baseType: !105, size: 32, offset: 1364416)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "SSN", scope: !343, file: !6, line: 297, baseType: !105, size: 32, offset: 1364448)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "LSN", scope: !343, file: !6, line: 298, baseType: !105, size: 32, offset: 1364480)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "MTU", scope: !343, file: !6, line: 299, baseType: !105, size: 32, offset: 1364512)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "init_sqn", scope: !343, file: !6, line: 300, baseType: !105, size: 32, offset: 1364544)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "dest_qp", scope: !343, file: !6, line: 301, baseType: !105, size: 32, offset: 1364576)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "src_port", scope: !343, file: !6, line: 302, baseType: !105, size: 32, offset: 1364608)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "dst_port", scope: !343, file: !6, line: 303, baseType: !105, size: 32, offset: 1364640)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "Rt", scope: !343, file: !6, line: 304, baseType: !105, size: 32, offset: 1364672)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Rc", scope: !343, file: !6, line: 305, baseType: !105, size: 32, offset: 1364704)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !343, file: !6, line: 306, baseType: !105, size: 32, offset: 1364736)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "byte_counter", scope: !343, file: !6, line: 307, baseType: !105, size: 32, offset: 1364768)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "BC", scope: !343, file: !6, line: 308, baseType: !105, size: 32, offset: 1364800)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "T1", scope: !343, file: !6, line: 309, baseType: !105, size: 32, offset: 1364832)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "F", scope: !343, file: !6, line: 310, baseType: !105, size: 32, offset: 1364864)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "Rai", scope: !343, file: !6, line: 311, baseType: !105, size: 32, offset: 1364896)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ecn_found_counter", scope: !343, file: !6, line: 312, baseType: !105, size: 32, offset: 1364928)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "first_pkt_connection", scope: !343, file: !6, line: 313, baseType: !97, size: 8, offset: 1364960)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "timer_ack_timeout", scope: !343, file: !6, line: 314, baseType: !447, size: 64, offset: 1364992)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timer_data", file: !6, line: 74, size: 64, elements: !448)
!448 = !{!449}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !447, file: !6, line: 75, baseType: !131, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "timer_cnp", scope: !343, file: !6, line: 315, baseType: !447, size: 64, offset: 1365056)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "timer_alpha", scope: !343, file: !6, line: 316, baseType: !447, size: 64, offset: 1365120)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "timer_DCQCN_counter", scope: !343, file: !6, line: 317, baseType: !447, size: 64, offset: 1365184)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !337, file: !3, line: 144, baseType: !147, size: 64, offset: 192)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "____fmt", scope: !456, file: !3, line: 2748, type: !498, isLocal: true, isDefinition: true)
!456 = distinct !DISubprogram(name: "net_ev_process", scope: !3, file: !3, line: 2727, type: !457, scopeLine: 2728, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !469)
!457 = !DISubroutineType(types: !458)
!458 = !{!141, !459, !145, !468}
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !31, line: 5461, size: 192, elements: !461)
!461 = !{!462, !463, !464, !465, !466, !467}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !460, file: !31, line: 5462, baseType: !105, size: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !460, file: !31, line: 5463, baseType: !105, size: 32, offset: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !460, file: !31, line: 5464, baseType: !105, size: 32, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !460, file: !31, line: 5466, baseType: !105, size: 32, offset: 96)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !460, file: !31, line: 5467, baseType: !105, size: 32, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "egress_ifindex", scope: !460, file: !31, line: 5469, baseType: !105, size: 32, offset: 160)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!469 = !{!470, !471, !472, !473, !497}
!470 = !DILocalVariable(name: "redirect_pkt", arg: 1, scope: !456, file: !3, line: 2727, type: !459)
!471 = !DILocalVariable(name: "f_id", arg: 2, scope: !456, file: !3, line: 2727, type: !145)
!472 = !DILocalVariable(name: "flow_context", arg: 3, scope: !456, file: !3, line: 2728, type: !468)
!473 = !DILocalVariable(name: "net_ev", scope: !456, file: !3, line: 2730, type: !474)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !475, size: 1152, elements: !159)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "net_event", file: !6, line: 186, size: 576, elements: !476)
!476 = !{!477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "event_type", scope: !475, file: !6, line: 188, baseType: !5, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ev_flow_id", scope: !475, file: !6, line: 189, baseType: !105, size: 32, offset: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "qp_id", scope: !475, file: !6, line: 190, baseType: !105, size: 32, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "wr_id", scope: !475, file: !6, line: 191, baseType: !105, size: 32, offset: 96)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "psn", scope: !475, file: !6, line: 192, baseType: !105, size: 32, offset: 128)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "credit_count", scope: !475, file: !6, line: 193, baseType: !105, size: 32, offset: 160)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "MSN", scope: !475, file: !6, line: 194, baseType: !105, size: 32, offset: 192)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_bytes_size", scope: !475, file: !6, line: 195, baseType: !105, size: 32, offset: 224)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "type_nack", scope: !475, file: !6, line: 196, baseType: !97, size: 8, offset: 256)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "RNR_delay", scope: !475, file: !6, line: 197, baseType: !105, size: 32, offset: 288)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "ack_req", scope: !475, file: !6, line: 198, baseType: !97, size: 8, offset: 320)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "raddr", scope: !475, file: !6, line: 199, baseType: !97, size: 8, offset: 328)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "rkey", scope: !475, file: !6, line: 200, baseType: !105, size: 32, offset: 352)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ecn", scope: !475, file: !6, line: 201, baseType: !97, size: 8, offset: 384)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "transit_addr", scope: !475, file: !6, line: 202, baseType: !97, size: 8, offset: 392)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !475, file: !6, line: 203, baseType: !105, size: 32, offset: 416)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !475, file: !6, line: 204, baseType: !105, size: 32, offset: 448)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !475, file: !6, line: 205, baseType: !105, size: 32, offset: 480)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "swap_add", scope: !475, file: !6, line: 206, baseType: !105, size: 32, offset: 512)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "compare", scope: !475, file: !6, line: 207, baseType: !105, size: 32, offset: 544)
!497 = !DILocalVariable(name: "ret", scope: !456, file: !3, line: 2732, type: !97)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 296, elements: !500)
!499 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !221)
!500 = !{!501}
!501 = !DISubrange(count: 37)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "____fmt", scope: !504, file: !3, line: 272, type: !572, isLocal: true, isDefinition: true)
!504 = distinct !DISubprogram(name: "parse_packet", scope: !3, file: !3, line: 243, type: !505, scopeLine: 244, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !508)
!505 = !DISubroutineType(types: !506)
!506 = !{!97, !87, !87, !507, !92}
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!508 = !{!509, !510, !511, !512, !513, !522, !550, !559, !564, !565, !566, !567, !569, !570, !571}
!509 = !DILocalVariable(name: "data", arg: 1, scope: !504, file: !3, line: 243, type: !87)
!510 = !DILocalVariable(name: "data_end", arg: 2, scope: !504, file: !3, line: 243, type: !87)
!511 = !DILocalVariable(name: "net_ev", arg: 3, scope: !504, file: !3, line: 244, type: !507)
!512 = !DILocalVariable(name: "meta_hdr", arg: 4, scope: !504, file: !3, line: 244, type: !92)
!513 = !DILocalVariable(name: "eth", scope: !504, file: !3, line: 245, type: !514)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !516, line: 168, size: 112, elements: !517)
!516 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "", checksumkind: CSK_MD5, checksum: "ab0320da726e75d904811ce344979934")
!517 = !{!518, !520, !521}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !515, file: !516, line: 169, baseType: !519, size: 48)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 48, elements: !99)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !515, file: !516, line: 170, baseType: !519, size: 48, offset: 48)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !515, file: !516, line: 171, baseType: !108, size: 16, offset: 96)
!522 = !DILocalVariable(name: "iphdr", scope: !504, file: !3, line: 246, type: !523)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !525, line: 87, size: 160, elements: !526)
!525 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "", checksumkind: CSK_MD5, checksum: "042b09a58768855e3578a0a8eba49be7")
!526 = !{!527, !528, !529, !530, !531, !532, !533, !534, !535, !537}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !524, file: !525, line: 89, baseType: !97, size: 4, flags: DIFlagBitField, extraData: i64 0)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !524, file: !525, line: 90, baseType: !97, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !524, file: !525, line: 97, baseType: !97, size: 8, offset: 8)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !524, file: !525, line: 98, baseType: !108, size: 16, offset: 16)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !524, file: !525, line: 99, baseType: !108, size: 16, offset: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !524, file: !525, line: 100, baseType: !108, size: 16, offset: 48)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !524, file: !525, line: 101, baseType: !97, size: 8, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !524, file: !525, line: 102, baseType: !97, size: 8, offset: 72)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !524, file: !525, line: 103, baseType: !536, size: 16, offset: 80)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !104, line: 31, baseType: !89)
!537 = !DIDerivedType(tag: DW_TAG_member, scope: !524, file: !525, line: 104, baseType: !538, size: 64, offset: 96)
!538 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !524, file: !525, line: 104, size: 64, elements: !539)
!539 = !{!540, !545}
!540 = !DIDerivedType(tag: DW_TAG_member, scope: !538, file: !525, line: 104, baseType: !541, size: 64)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !538, file: !525, line: 104, size: 64, elements: !542)
!542 = !{!543, !544}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !541, file: !525, line: 104, baseType: !103, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !541, file: !525, line: 104, baseType: !103, size: 32, offset: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !538, file: !525, line: 104, baseType: !546, size: 64)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !538, file: !525, line: 104, size: 64, elements: !547)
!547 = !{!548, !549}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !546, file: !525, line: 104, baseType: !103, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !546, file: !525, line: 104, baseType: !103, size: 32, offset: 32)
!550 = !DILocalVariable(name: "udph", scope: !504, file: !3, line: 248, type: !551)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "udphdr", file: !553, line: 23, size: 64, elements: !554)
!553 = !DIFile(filename: "/usr/include/linux/udp.h", directory: "", checksumkind: CSK_MD5, checksum: "53c0d42e1bf6d93b39151764be2d20fb")
!554 = !{!555, !556, !557, !558}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !552, file: !553, line: 24, baseType: !108, size: 16)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !552, file: !553, line: 25, baseType: !108, size: 16, offset: 16)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !552, file: !553, line: 26, baseType: !108, size: 16, offset: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !552, file: !553, line: 27, baseType: !536, size: 16, offset: 48)
!559 = !DILocalVariable(name: "nh", scope: !504, file: !3, line: 250, type: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hdr_cursor", file: !561, line: 33, size: 64, elements: !562)
!561 = !DIFile(filename: "./../common/parsing_helpers.h", directory: "/home/rcsguest/XDP-Tryouts/xdp/rocev2", checksumkind: CSK_MD5, checksum: "172efdd203783aed49c0ce78645261a8")
!562 = !{!563}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !560, file: !561, line: 34, baseType: !87, size: 64)
!564 = !DILocalVariable(name: "eth_type", scope: !504, file: !3, line: 251, type: !141)
!565 = !DILocalVariable(name: "ip_type", scope: !504, file: !3, line: 251, type: !141)
!566 = !DILocalVariable(name: "flow_hash_id", scope: !504, file: !3, line: 267, type: !272)
!567 = !DILocalVariable(name: "bthdr", scope: !504, file: !3, line: 279, type: !568)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!569 = !DILocalVariable(name: "opcode", scope: !504, file: !3, line: 280, type: !141)
!570 = !DILocalVariable(name: "flow_array_id", scope: !504, file: !3, line: 286, type: !145)
!571 = !DILocalVariable(name: "ret", scope: !504, file: !3, line: 299, type: !97)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 360, elements: !573)
!573 = !{!574}
!574 = !DISubrange(count: 45)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(name: "____fmt", scope: !504, file: !3, line: 282, type: !572, isLocal: true, isDefinition: true)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(name: "____fmt", scope: !579, file: !3, line: 207, type: !585, isLocal: true, isDefinition: true)
!579 = distinct !DISubprogram(name: "retrieve_flow_array_id", scope: !3, file: !3, line: 204, type: !580, scopeLine: 204, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !582)
!580 = !DISubroutineType(types: !581)
!581 = !{!145, !272}
!582 = !{!583, !584}
!583 = !DILocalVariable(name: "flow_hash_id", arg: 1, scope: !579, file: !3, line: 204, type: !272)
!584 = !DILocalVariable(name: "flow_array_id", scope: !579, file: !3, line: 205, type: !145)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 472, elements: !586)
!586 = !{!587}
!587 = !DISubrange(count: 59)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "bpf_xdp_adjust_head", scope: !2, file: !590, line: 1134, type: !591, isLocal: true, isDefinition: true)
!590 = !DIFile(filename: "../lib/install/include/bpf/bpf_helper_defs.h", directory: "/home/rcsguest/XDP-Tryouts/xdp/rocev2", checksumkind: CSK_MD5, checksum: "7422ca06c9dc86eba2f268a57d8acf2f")
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DISubroutineType(types: !593)
!593 = !{!88, !459, !141}
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(name: "bpf_xdp_adjust_tail", scope: !2, file: !590, line: 1720, type: !591, isLocal: true, isDefinition: true)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(name: "____fmt", scope: !598, file: !3, line: 357, type: !604, isLocal: true, isDefinition: true)
!598 = distinct !DISubprogram(name: "retrieve_ctx", scope: !3, file: !3, line: 354, type: !599, scopeLine: 354, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !601)
!599 = !DISubroutineType(types: !600)
!600 = !{!342, !105}
!601 = !{!602, !603}
!602 = !DILocalVariable(name: "f_id", arg: 1, scope: !598, file: !3, line: 354, type: !105)
!603 = !DILocalVariable(name: "ctx", scope: !598, file: !3, line: 355, type: !342)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 344, elements: !605)
!605 = !{!606}
!606 = !DISubrange(count: 43)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !590, line: 177, type: !609, isLocal: true, isDefinition: true)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DISubroutineType(types: !611)
!611 = !{!88, !612, !105, null}
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(name: "bpf_timer_cancel", scope: !2, file: !590, line: 4057, type: !615, isLocal: true, isDefinition: true)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = !DISubroutineType(types: !617)
!617 = !{!88, !618}
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(name: "____fmt", scope: !621, file: !3, line: 694, type: !630, isLocal: true, isDefinition: true)
!621 = distinct !DISubprogram(name: "initialize_timer", scope: !3, file: !3, line: 689, type: !622, scopeLine: 690, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !624)
!622 = !DISubroutineType(types: !623)
!623 = !{!141, !125, !131, !69}
!624 = !{!625, !626, !627, !628, !629}
!625 = !DILocalVariable(name: "event", arg: 1, scope: !621, file: !3, line: 689, type: !125)
!626 = !DILocalVariable(name: "time", arg: 2, scope: !621, file: !3, line: 690, type: !131)
!627 = !DILocalVariable(name: "index", arg: 3, scope: !621, file: !3, line: 690, type: !69)
!628 = !DILocalVariable(name: "map_entry", scope: !621, file: !3, line: 692, type: !322)
!629 = !DILocalVariable(name: "err", scope: !621, file: !3, line: 706, type: !88)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 384, elements: !631)
!631 = !{!632}
!632 = !DISubrange(count: 48)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(name: "____fmt", scope: !621, file: !3, line: 714, type: !635, isLocal: true, isDefinition: true)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 272, elements: !636)
!636 = !{!637}
!637 = !DISubrange(count: 34)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(name: "____fmt", scope: !621, file: !3, line: 719, type: !640, isLocal: true, isDefinition: true)
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 256, elements: !641)
!641 = !{!642}
!642 = !DISubrange(count: 32)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(name: "____fmt", scope: !645, file: !3, line: 681, type: !656, isLocal: true, isDefinition: true)
!645 = distinct !DISubprogram(name: "retrieve_timer", scope: !3, file: !3, line: 672, type: !646, scopeLine: 672, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !648)
!646 = !DISubroutineType(types: !647)
!647 = !{!322, !105, !69}
!648 = !{!649, !650, !651, !652, !653}
!649 = !DILocalVariable(name: "f_id", arg: 1, scope: !645, file: !3, line: 672, type: !105)
!650 = !DILocalVariable(name: "index", arg: 2, scope: !645, file: !3, line: 672, type: !69)
!651 = !DILocalVariable(name: "timer_id", scope: !645, file: !3, line: 673, type: !317)
!652 = !DILocalVariable(name: "map_entry", scope: !645, file: !3, line: 674, type: !322)
!653 = !DILocalVariable(name: "new_entry", scope: !654, file: !3, line: 676, type: !323)
!654 = distinct !DILexicalBlock(scope: !655, file: !3, line: 675, column: 20)
!655 = distinct !DILexicalBlock(scope: !645, file: !3, line: 675, column: 8)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 368, elements: !657)
!657 = !{!658}
!658 = !DISubrange(count: 46)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !590, line: 78, type: !661, isLocal: true, isDefinition: true)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{!88, !87, !664, !664, !131}
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(name: "bpf_timer_init", scope: !2, file: !590, line: 3992, type: !668, isLocal: true, isDefinition: true)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{!88, !618, !87, !131}
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(name: "bpf_timer_set_callback", scope: !2, file: !590, line: 4007, type: !673, isLocal: true, isDefinition: true)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DISubroutineType(types: !675)
!675 = !{!88, !618, !87}
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(name: "____fmt", scope: !678, file: !3, line: 583, type: !692, isLocal: true, isDefinition: true)
!678 = distinct !DISubprogram(name: "timer_event_enqueue", scope: !3, file: !3, line: 570, type: !679, scopeLine: 570, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !681)
!679 = !DISubroutineType(types: !680)
!680 = !{!141, !87, !145, !322}
!681 = !{!682, !683, !684, !685, !686, !687, !689, !690, !691}
!682 = !DILocalVariable(name: "map", arg: 1, scope: !678, file: !3, line: 570, type: !87)
!683 = !DILocalVariable(name: "f_id", arg: 2, scope: !678, file: !3, line: 570, type: !145)
!684 = !DILocalVariable(name: "val", arg: 3, scope: !678, file: !3, line: 570, type: !322)
!685 = !DILocalVariable(name: "event", scope: !678, file: !3, line: 571, type: !125)
!686 = !DILocalVariable(name: "f_info", scope: !678, file: !3, line: 575, type: !287)
!687 = !DILocalVariable(name: "executing", scope: !678, file: !3, line: 578, type: !688)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!689 = !DILocalVariable(name: "queue_len", scope: !678, file: !3, line: 579, type: !688)
!690 = !DILocalVariable(name: "tail", scope: !678, file: !3, line: 580, type: !145)
!691 = !DILocalVariable(name: "inner_array", scope: !678, file: !3, line: 598, type: !195)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 448, elements: !693)
!693 = !{!694}
!694 = !DISubrange(count: 56)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(name: "____fmt", scope: !678, file: !3, line: 593, type: !697, isLocal: true, isDefinition: true)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 488, elements: !698)
!698 = !{!699}
!699 = !DISubrange(count: 61)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(name: "____fmt", scope: !678, file: !3, line: 600, type: !692, isLocal: true, isDefinition: true)
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(name: "____fmt", scope: !678, file: !3, line: 606, type: !585, isLocal: true, isDefinition: true)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(name: "bpf_timer_start", scope: !2, file: !590, line: 4043, type: !706, isLocal: true, isDefinition: true)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!88, !618, !131, !131}
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(name: "____fmt", scope: !711, file: !3, line: 2355, type: !740, isLocal: true, isDefinition: true)
!711 = distinct !DISubprogram(name: "RemoveSQProcessor_net_event", scope: !3, file: !3, line: 2334, type: !712, scopeLine: 2335, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !720)
!712 = !DISubroutineType(types: !713)
!713 = !{null, !507, !342, !714, !459}
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "interm_out", file: !6, line: 77, size: 64, elements: !716)
!716 = !{!717, !718, !719}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "psn", scope: !715, file: !6, line: 79, baseType: !105, size: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_counter", scope: !715, file: !6, line: 80, baseType: !97, size: 8, offset: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "remove_counter", scope: !715, file: !6, line: 81, baseType: !97, size: 8, offset: 40)
!720 = !{!721, !722, !723, !724, !725, !726, !727, !734}
!721 = !DILocalVariable(name: "ev", arg: 1, scope: !711, file: !3, line: 2334, type: !507)
!722 = !DILocalVariable(name: "ctx", arg: 2, scope: !711, file: !3, line: 2334, type: !342)
!723 = !DILocalVariable(name: "out", arg: 3, scope: !711, file: !3, line: 2334, type: !714)
!724 = !DILocalVariable(name: "redirect_pkt", arg: 4, scope: !711, file: !3, line: 2334, type: !459)
!725 = !DILocalVariable(name: "remove_counter", scope: !711, file: !3, line: 2336, type: !105)
!726 = !DILocalVariable(name: "i", scope: !711, file: !3, line: 2337, type: !105)
!727 = !DILocalVariable(name: "arg16", scope: !711, file: !3, line: 2338, type: !728)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_arg16", file: !6, line: 419, size: 192, elements: !729)
!729 = !{!730, !731, !732, !733}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "ev", scope: !728, file: !6, line: 420, baseType: !507, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !728, file: !6, line: 421, baseType: !342, size: 64, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !728, file: !6, line: 422, baseType: !105, size: 32, offset: 128)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "remove_counter", scope: !728, file: !6, line: 423, baseType: !105, size: 32, offset: 160)
!734 = !DILocalVariable(name: "arg17", scope: !711, file: !3, line: 2348, type: !735)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_arg17", file: !6, line: 425, size: 192, elements: !736)
!736 = !{!737, !738, !739}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !735, file: !6, line: 426, baseType: !342, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !735, file: !6, line: 427, baseType: !105, size: 32, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !735, file: !6, line: 428, baseType: !714, size: 64, offset: 128)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 24, elements: !741)
!741 = !{!742}
!742 = !DISubrange(count: 3)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(name: "____fmt", scope: !745, file: !3, line: 1562, type: !771, isLocal: true, isDefinition: true)
!745 = distinct !DISubprogram(name: "WriteDataProcessor", scope: !3, file: !3, line: 1560, type: !712, scopeLine: 1561, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !746)
!746 = !{!747, !748, !749, !750, !751, !752, !766, !767, !770}
!747 = !DILocalVariable(name: "ev", arg: 1, scope: !745, file: !3, line: 1560, type: !507)
!748 = !DILocalVariable(name: "ctx", arg: 2, scope: !745, file: !3, line: 1560, type: !342)
!749 = !DILocalVariable(name: "out", arg: 3, scope: !745, file: !3, line: 1560, type: !714)
!750 = !DILocalVariable(name: "redirect_pkt", arg: 4, scope: !745, file: !3, line: 1560, type: !459)
!751 = !DILocalVariable(name: "pkt_ev", scope: !745, file: !3, line: 1564, type: !359)
!752 = !DILocalVariable(name: "fb_new_event", scope: !753, file: !3, line: 1600, type: !755)
!753 = distinct !DILexicalBlock(scope: !754, file: !3, line: 1598, column: 2)
!754 = distinct !DILexicalBlock(scope: !745, file: !3, line: 1597, column: 6)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "app_metadata", file: !6, line: 227, size: 256, elements: !756)
!756 = !{!757, !758, !759, !760, !761, !762, !763, !764, !765}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "type_metadata", scope: !755, file: !6, line: 229, baseType: !97, size: 8)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "write_to_mem", scope: !755, file: !6, line: 230, baseType: !97, size: 8, offset: 8)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "fb_type", scope: !755, file: !6, line: 231, baseType: !105, size: 32, offset: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !755, file: !6, line: 232, baseType: !105, size: 32, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "type_error", scope: !755, file: !6, line: 233, baseType: !105, size: 32, offset: 96)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !755, file: !6, line: 234, baseType: !97, size: 8, offset: 128)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !755, file: !6, line: 235, baseType: !105, size: 32, offset: 160)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !755, file: !6, line: 236, baseType: !105, size: 32, offset: 192)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "transit_addr", scope: !755, file: !6, line: 237, baseType: !97, size: 8, offset: 224)
!766 = !DILocalVariable(name: "meta_hdr", scope: !753, file: !3, line: 1608, type: !92)
!767 = !DILocalVariable(name: "responder_info", scope: !768, file: !3, line: 1619, type: !419)
!768 = distinct !DILexicalBlock(scope: !769, file: !3, line: 1618, column: 2)
!769 = distinct !DILexicalBlock(scope: !745, file: !3, line: 1617, column: 6)
!770 = !DILocalVariable(name: "new_event", scope: !768, file: !3, line: 1626, type: !114)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 136, elements: !248)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(name: "____fmt", scope: !774, file: !3, line: 367, type: !656, isLocal: true, isDefinition: true)
!774 = distinct !DISubprogram(name: "update_app_len", scope: !3, file: !3, line: 363, type: !775, scopeLine: 363, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !778)
!775 = !DISubroutineType(types: !776)
!776 = !{null, !777, !105}
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!778 = !{!779, !780, !781, !782}
!779 = !DILocalVariable(name: "app_info", arg: 1, scope: !774, file: !3, line: 363, type: !777)
!780 = !DILocalVariable(name: "f_id", arg: 2, scope: !774, file: !3, line: 363, type: !105)
!781 = !DILocalVariable(name: "app_tail", scope: !774, file: !3, line: 365, type: !145)
!782 = !DILocalVariable(name: "new_tail", scope: !783, file: !3, line: 368, type: !105)
!783 = distinct !DILexicalBlock(scope: !784, file: !3, line: 366, column: 19)
!784 = distinct !DILexicalBlock(scope: !774, file: !3, line: 366, column: 8)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(name: "bpf_loop", scope: !2, file: !590, line: 4216, type: !787, isLocal: true, isDefinition: true)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DISubroutineType(types: !789)
!789 = !{!88, !105, !87, !87, !131}
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(name: "____fmt", scope: !792, file: !3, line: 544, type: !802, isLocal: true, isDefinition: true)
!792 = distinct !DISubprogram(name: "app_event_dequeue", scope: !3, file: !3, line: 541, type: !793, scopeLine: 542, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !796)
!793 = !DISubroutineType(types: !794)
!794 = !{!163, !105, !795, !795}
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!796 = !{!797, !798, !799, !800, !801}
!797 = !DILocalVariable(name: "f_id", arg: 1, scope: !792, file: !3, line: 541, type: !105)
!798 = !DILocalVariable(name: "queue_len", arg: 2, scope: !792, file: !3, line: 542, type: !795)
!799 = !DILocalVariable(name: "head", arg: 3, scope: !792, file: !3, line: 542, type: !795)
!800 = !DILocalVariable(name: "inner_flow_array", scope: !792, file: !3, line: 548, type: !87)
!801 = !DILocalVariable(name: "event", scope: !792, file: !3, line: 554, type: !163)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 504, elements: !803)
!803 = !{!804}
!804 = !DISubrange(count: 63)
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(name: "____fmt", scope: !792, file: !3, line: 550, type: !585, isLocal: true, isDefinition: true)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(name: "____fmt", scope: !792, file: !3, line: 556, type: !585, isLocal: true, isDefinition: true)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(name: "____fmt", scope: !811, file: !3, line: 1134, type: !836, isLocal: true, isDefinition: true)
!811 = distinct !DISubprogram(name: "TransmitProcessor_app_event", scope: !3, file: !3, line: 1132, type: !812, scopeLine: 1133, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !814)
!812 = !DISubroutineType(types: !813)
!813 = !{null, !163, !342, !714, !459}
!814 = !{!815, !816, !817, !818, !819, !822, !823, !824, !825, !826, !827}
!815 = !DILocalVariable(name: "ev", arg: 1, scope: !811, file: !3, line: 1132, type: !163)
!816 = !DILocalVariable(name: "ctx", arg: 2, scope: !811, file: !3, line: 1132, type: !342)
!817 = !DILocalVariable(name: "out", arg: 3, scope: !811, file: !3, line: 1132, type: !714)
!818 = !DILocalVariable(name: "redirect_pkt", arg: 4, scope: !811, file: !3, line: 1132, type: !459)
!819 = !DILocalVariable(name: "new_event", scope: !820, file: !3, line: 1137, type: !125)
!820 = distinct !DILexicalBlock(scope: !821, file: !3, line: 1136, column: 2)
!821 = distinct !DILexicalBlock(scope: !811, file: !3, line: 1135, column: 6)
!822 = !DILocalVariable(name: "alpha_timeout", scope: !820, file: !3, line: 1142, type: !105)
!823 = !DILocalVariable(name: "new_event2", scope: !820, file: !3, line: 1145, type: !125)
!824 = !DILocalVariable(name: "DCQCN_timeout", scope: !820, file: !3, line: 1150, type: !105)
!825 = !DILocalVariable(name: "number_packets_sent", scope: !811, file: !3, line: 1157, type: !105)
!826 = !DILocalVariable(name: "i", scope: !811, file: !3, line: 1158, type: !105)
!827 = !DILocalVariable(name: "arg3", scope: !811, file: !3, line: 1159, type: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_arg3", file: !6, line: 337, size: 384, elements: !829)
!829 = !{!830, !831, !832, !833, !834, !835}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !828, file: !6, line: 338, baseType: !342, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !828, file: !6, line: 339, baseType: !105, size: 32, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !828, file: !6, line: 340, baseType: !714, size: 64, offset: 128)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_pkt", scope: !828, file: !6, line: 341, baseType: !459, size: 64, offset: 192)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "number_packets_sent", scope: !828, file: !6, line: 342, baseType: !105, size: 32, offset: 256)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "ev", scope: !828, file: !6, line: 343, baseType: !163, size: 64, offset: 320)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 72, elements: !837)
!837 = !{!838}
!838 = !DISubrange(count: 9)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(name: "____fmt", scope: !841, file: !3, line: 1078, type: !857, isLocal: true, isDefinition: true)
!841 = distinct !DISubprogram(name: "loop_function3", scope: !3, file: !3, line: 1070, type: !842, scopeLine: 1071, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !845)
!842 = !DISubroutineType(types: !843)
!843 = !{!88, !105, !844}
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!845 = !{!846, !847, !848, !853, !854}
!846 = !DILocalVariable(name: "index", arg: 1, scope: !841, file: !3, line: 1070, type: !105)
!847 = !DILocalVariable(name: "arg", arg: 2, scope: !841, file: !3, line: 1070, type: !844)
!848 = !DILocalVariable(name: "meta_hdr", scope: !849, file: !3, line: 1092, type: !92)
!849 = distinct !DILexicalBlock(scope: !850, file: !3, line: 1088, column: 3)
!850 = distinct !DILexicalBlock(scope: !851, file: !3, line: 1087, column: 7)
!851 = distinct !DILexicalBlock(scope: !852, file: !3, line: 1086, column: 2)
!852 = distinct !DILexicalBlock(scope: !841, file: !3, line: 1085, column: 6)
!853 = !DILocalVariable(name: "meta_hdr", scope: !851, file: !3, line: 1107, type: !92)
!854 = !DILocalVariable(name: "new_event", scope: !855, file: !3, line: 1120, type: !114)
!855 = distinct !DILexicalBlock(scope: !856, file: !3, line: 1117, column: 3)
!856 = distinct !DILexicalBlock(scope: !851, file: !3, line: 1116, column: 7)
!857 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 144, elements: !858)
!858 = !{!859}
!859 = !DISubrange(count: 18)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(name: "____fmt", scope: !862, file: !3, line: 912, type: !879, isLocal: true, isDefinition: true)
!862 = distinct !DISubprogram(name: "WriteProcessor", scope: !3, file: !3, line: 910, type: !812, scopeLine: 911, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !863)
!863 = !{!864, !865, !866, !867, !868, !871, !872}
!864 = !DILocalVariable(name: "ev", arg: 1, scope: !862, file: !3, line: 910, type: !163)
!865 = !DILocalVariable(name: "ctx", arg: 2, scope: !862, file: !3, line: 910, type: !342)
!866 = !DILocalVariable(name: "out", arg: 3, scope: !862, file: !3, line: 910, type: !714)
!867 = !DILocalVariable(name: "redirect_pkt", arg: 4, scope: !862, file: !3, line: 910, type: !459)
!868 = !DILocalVariable(name: "first_psn", scope: !869, file: !3, line: 921, type: !105)
!869 = distinct !DILexicalBlock(scope: !870, file: !3, line: 920, column: 2)
!870 = distinct !DILexicalBlock(scope: !862, file: !3, line: 919, column: 6)
!871 = !DILocalVariable(name: "index", scope: !869, file: !3, line: 922, type: !105)
!872 = !DILocalVariable(name: "arg1", scope: !869, file: !3, line: 923, type: !873)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_arg1", file: !6, line: 325, size: 256, elements: !874)
!874 = !{!875, !876, !877, !878}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !873, file: !6, line: 326, baseType: !105, size: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "ev", scope: !873, file: !6, line: 327, baseType: !163, size: 64, offset: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !873, file: !6, line: 328, baseType: !342, size: 64, offset: 128)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "first_psn", scope: !873, file: !6, line: 329, baseType: !105, size: 32, offset: 192)
!879 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 48, elements: !99)
!880 = !DIGlobalVariableExpression(var: !881, expr: !DIExpression())
!881 = distinct !DIGlobalVariable(name: "____fmt", scope: !882, file: !3, line: 478, type: !891, isLocal: true, isDefinition: true)
!882 = distinct !DISubprogram(name: "timer_event_dequeue", scope: !3, file: !3, line: 475, type: !883, scopeLine: 476, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !885)
!883 = !DISubroutineType(types: !884)
!884 = !{!87, !105, !688, !795}
!885 = !{!886, !887, !888, !889, !890}
!886 = !DILocalVariable(name: "f_id", arg: 1, scope: !882, file: !3, line: 475, type: !105)
!887 = !DILocalVariable(name: "queue_len", arg: 2, scope: !882, file: !3, line: 476, type: !688)
!888 = !DILocalVariable(name: "head", arg: 3, scope: !882, file: !3, line: 476, type: !795)
!889 = !DILocalVariable(name: "inner_flow_array", scope: !882, file: !3, line: 482, type: !87)
!890 = !DILocalVariable(name: "event", scope: !882, file: !3, line: 489, type: !124)
!891 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 512, elements: !892)
!892 = !{!893}
!893 = !DISubrange(count: 64)
!894 = !DIGlobalVariableExpression(var: !895, expr: !DIExpression())
!895 = distinct !DIGlobalVariable(name: "____fmt", scope: !882, file: !3, line: 485, type: !585, isLocal: true, isDefinition: true)
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(name: "____fmt", scope: !882, file: !3, line: 491, type: !585, isLocal: true, isDefinition: true)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(name: "____fmt", scope: !882, file: !3, line: 507, type: !802, isLocal: true, isDefinition: true)
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(name: "____fmt", scope: !902, file: !3, line: 653, type: !572, isLocal: true, isDefinition: true)
!902 = distinct !DISubprogram(name: "restart_timer", scope: !3, file: !3, line: 647, type: !903, scopeLine: 648, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !905)
!903 = !DISubroutineType(types: !904)
!904 = !{!141, !105, !131, !69}
!905 = !{!906, !907, !908, !909, !910}
!906 = !DILocalVariable(name: "f_id", arg: 1, scope: !902, file: !3, line: 647, type: !105)
!907 = !DILocalVariable(name: "time", arg: 2, scope: !902, file: !3, line: 647, type: !131)
!908 = !DILocalVariable(name: "index", arg: 3, scope: !902, file: !3, line: 648, type: !69)
!909 = !DILocalVariable(name: "timer_id", scope: !902, file: !3, line: 650, type: !317)
!910 = !DILocalVariable(name: "map_entry", scope: !902, file: !3, line: 651, type: !322)
!911 = !DIGlobalVariableExpression(var: !912, expr: !DIExpression())
!912 = distinct !DIGlobalVariable(name: "____fmt", scope: !902, file: !3, line: 665, type: !913, isLocal: true, isDefinition: true)
!913 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 304, elements: !914)
!914 = !{!915}
!915 = !DISubrange(count: 38)
!916 = !DIGlobalVariableExpression(var: !917, expr: !DIExpression())
!917 = distinct !DIGlobalVariable(name: "____fmt", scope: !918, file: !3, line: 515, type: !802, isLocal: true, isDefinition: true)
!918 = distinct !DISubprogram(name: "prog_event_dequeue", scope: !3, file: !3, line: 512, type: !919, scopeLine: 513, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !921)
!919 = !DISubroutineType(types: !920)
!920 = !{!113, !105, !795, !795}
!921 = !{!922, !923, !924, !925, !926}
!922 = !DILocalVariable(name: "f_id", arg: 1, scope: !918, file: !3, line: 512, type: !105)
!923 = !DILocalVariable(name: "queue_len", arg: 2, scope: !918, file: !3, line: 513, type: !795)
!924 = !DILocalVariable(name: "head", arg: 3, scope: !918, file: !3, line: 513, type: !795)
!925 = !DILocalVariable(name: "inner_flow_array", scope: !918, file: !3, line: 519, type: !87)
!926 = !DILocalVariable(name: "event", scope: !918, file: !3, line: 525, type: !113)
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(name: "____fmt", scope: !918, file: !3, line: 521, type: !585, isLocal: true, isDefinition: true)
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression())
!930 = distinct !DIGlobalVariable(name: "____fmt", scope: !918, file: !3, line: 527, type: !585, isLocal: true, isDefinition: true)
!931 = !DIGlobalVariableExpression(var: !932, expr: !DIExpression())
!932 = distinct !DIGlobalVariable(name: "____fmt", scope: !933, file: !3, line: 2109, type: !740, isLocal: true, isDefinition: true)
!933 = distinct !DISubprogram(name: "ResponderProcessor", scope: !3, file: !3, line: 2097, type: !934, scopeLine: 2098, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !936)
!934 = !DISubroutineType(types: !935)
!935 = !{null, !113, !342, !714, !459}
!936 = !{!937, !938, !939, !940, !941, !942, !943, !950}
!937 = !DILocalVariable(name: "ev", arg: 1, scope: !933, file: !3, line: 2097, type: !113)
!938 = !DILocalVariable(name: "ctx", arg: 2, scope: !933, file: !3, line: 2097, type: !342)
!939 = !DILocalVariable(name: "out", arg: 3, scope: !933, file: !3, line: 2097, type: !714)
!940 = !DILocalVariable(name: "redirect_pkt", arg: 4, scope: !933, file: !3, line: 2097, type: !459)
!941 = !DILocalVariable(name: "counter_pkts", scope: !933, file: !3, line: 2099, type: !105)
!942 = !DILocalVariable(name: "i", scope: !933, file: !3, line: 2100, type: !105)
!943 = !DILocalVariable(name: "arg11", scope: !933, file: !3, line: 2101, type: !944)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_arg11", file: !6, line: 389, size: 256, elements: !945)
!945 = !{!946, !947, !948, !949}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !944, file: !6, line: 390, baseType: !342, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !944, file: !6, line: 391, baseType: !105, size: 32, offset: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_pkt", scope: !944, file: !6, line: 392, baseType: !459, size: 64, offset: 128)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "counter_pkts", scope: !944, file: !6, line: 393, baseType: !105, size: 32, offset: 192)
!950 = !DILocalVariable(name: "arg12", scope: !933, file: !3, line: 2111, type: !951)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_arg12", file: !6, line: 395, size: 128, elements: !952)
!952 = !{!953, !954, !955}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !951, file: !6, line: 396, baseType: !342, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !951, file: !6, line: 397, baseType: !105, size: 32, offset: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "counter_pkts", scope: !951, file: !6, line: 398, baseType: !105, size: 32, offset: 96)
!956 = !DIGlobalVariableExpression(var: !957, expr: !DIExpression())
!957 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !590, line: 56, type: !958, isLocal: true, isDefinition: true)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DISubroutineType(types: !960)
!960 = !{!87, !87, !664}
!961 = !DIGlobalVariableExpression(var: !962, expr: !DIExpression())
!962 = distinct !DIGlobalVariable(name: "bpf_redirect_map", scope: !2, file: !590, line: 1323, type: !963, isLocal: true, isDefinition: true)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DISubroutineType(types: !965)
!965 = !{!88, !87, !131, !131}
!966 = !{i32 7, !"Dwarf Version", i32 5}
!967 = !{i32 2, !"Debug Info Version", i32 3}
!968 = !{i32 1, !"wchar_size", i32 4}
!969 = !{i32 7, !"frame-pointer", i32 2}
!970 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!971 = distinct !DISubprogram(name: "net_arrive", scope: !3, file: !3, line: 2769, type: !972, scopeLine: 2770, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !974)
!972 = !DISubroutineType(types: !973)
!973 = !{!141, !459}
!974 = !{!975, !976, !983}
!975 = !DILocalVariable(name: "redirect_pkt", arg: 1, scope: !971, file: !3, line: 2769, type: !459)
!976 = !DILocalVariable(name: "arg", scope: !971, file: !3, line: 2773, type: !977)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_loop_args", file: !6, line: 454, size: 256, elements: !978)
!978 = !{!979, !980, !981, !982}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "f_info", scope: !977, file: !6, line: 455, baseType: !287, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "f_id", scope: !977, file: !6, line: 456, baseType: !105, size: 32, offset: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !977, file: !6, line: 457, baseType: !342, size: 64, offset: 128)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "redirect_pkt", scope: !977, file: !6, line: 458, baseType: !459, size: 64, offset: 192)
!983 = !DILocalVariable(name: "rx_queue_index", scope: !971, file: !3, line: 2793, type: !141)
!984 = !DILocation(line: 0, scope: !971)
!985 = !DILocation(line: 2773, column: 5, scope: !971)
!986 = !DILocation(line: 2773, column: 28, scope: !971)
!987 = !DILocation(line: 2774, column: 9, scope: !971)
!988 = !DILocation(line: 2774, column: 13, scope: !971)
!989 = !{!990, !991, i64 16}
!990 = !{!"sched_loop_args", !991, i64 0, !994, i64 8, !991, i64 16, !991, i64 24}
!991 = !{!"any pointer", !992, i64 0}
!992 = !{!"omnipotent char", !993, i64 0}
!993 = !{!"Simple C/C++ TBAA"}
!994 = !{!"int", !992, i64 0}
!995 = !DILocation(line: 2775, column: 9, scope: !971)
!996 = !DILocation(line: 2775, column: 22, scope: !971)
!997 = !{!990, !991, i64 24}
!998 = !DILocation(line: 2778, column: 43, scope: !999)
!999 = distinct !DILexicalBlock(scope: !971, file: !3, line: 2778, column: 8)
!1000 = !DILocation(line: 0, scope: !456, inlinedAt: !1001)
!1001 = distinct !DILocation(line: 2778, column: 9, scope: !999)
!1002 = !DILocation(line: 2730, column: 5, scope: !456, inlinedAt: !1001)
!1003 = !DILocation(line: 2730, column: 22, scope: !456, inlinedAt: !1001)
!1004 = !DILocation(line: 2732, column: 41, scope: !456, inlinedAt: !1001)
!1005 = !DILocalVariable(name: "new_hdr", scope: !1006, file: !3, line: 322, type: !93)
!1006 = distinct !DISubprogram(name: "mutate_pkt", scope: !3, file: !3, line: 311, type: !1007, scopeLine: 311, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1009)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!97, !459, !507}
!1009 = !{!1010, !1011, !1012, !1013, !1014, !1015, !1016, !1005, !1017}
!1010 = !DILocalVariable(name: "redirect_pkt", arg: 1, scope: !1006, file: !3, line: 311, type: !459)
!1011 = !DILocalVariable(name: "net_ev", arg: 2, scope: !1006, file: !3, line: 311, type: !507)
!1012 = !DILocalVariable(name: "data_end", scope: !1006, file: !3, line: 313, type: !87)
!1013 = !DILocalVariable(name: "data", scope: !1006, file: !3, line: 314, type: !87)
!1014 = !DILocalVariable(name: "pkt_len", scope: !1006, file: !3, line: 316, type: !105)
!1015 = !DILocalVariable(name: "original_header_len", scope: !1006, file: !3, line: 318, type: !105)
!1016 = !DILocalVariable(name: "new_header_len", scope: !1006, file: !3, line: 320, type: !105)
!1017 = !DILocalVariable(name: "ret", scope: !1006, file: !3, line: 324, type: !97)
!1018 = !DILocation(line: 322, column: 25, scope: !1006, inlinedAt: !1019)
!1019 = distinct !DILocation(line: 2732, column: 16, scope: !456, inlinedAt: !1001)
!1020 = !DILocation(line: 0, scope: !1006, inlinedAt: !1019)
!1021 = !DILocation(line: 313, column: 50, scope: !1006, inlinedAt: !1019)
!1022 = !{!1023, !994, i64 4}
!1023 = !{!"xdp_md", !994, i64 0, !994, i64 4, !994, i64 8, !994, i64 12, !994, i64 16, !994, i64 20}
!1024 = !DILocation(line: 313, column: 30, scope: !1006, inlinedAt: !1019)
!1025 = !DILocation(line: 313, column: 22, scope: !1006, inlinedAt: !1019)
!1026 = !DILocation(line: 314, column: 50, scope: !1006, inlinedAt: !1019)
!1027 = !{!1023, !994, i64 0}
!1028 = !DILocation(line: 314, column: 30, scope: !1006, inlinedAt: !1019)
!1029 = !DILocation(line: 314, column: 22, scope: !1006, inlinedAt: !1019)
!1030 = !DILocation(line: 322, column: 5, scope: !1006, inlinedAt: !1019)
!1031 = !DILocation(line: 0, scope: !504, inlinedAt: !1032)
!1032 = distinct !DILocation(line: 324, column: 16, scope: !1006, inlinedAt: !1019)
!1033 = !DILocalVariable(name: "nh", arg: 1, scope: !1034, file: !561, line: 124, type: !1037)
!1034 = distinct !DISubprogram(name: "parse_ethhdr", scope: !561, file: !561, line: 124, type: !1035, scopeLine: 127, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1039)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!141, !1037, !87, !1038}
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!1039 = !{!1033, !1040, !1041}
!1040 = !DILocalVariable(name: "data_end", arg: 2, scope: !1034, file: !561, line: 125, type: !87)
!1041 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !1034, file: !561, line: 126, type: !1038)
!1042 = !DILocation(line: 0, scope: !1034, inlinedAt: !1043)
!1043 = distinct !DILocation(line: 255, column: 16, scope: !504, inlinedAt: !1032)
!1044 = !DILocalVariable(name: "nh", arg: 1, scope: !1045, file: !561, line: 79, type: !1037)
!1045 = distinct !DISubprogram(name: "parse_ethhdr_vlan", scope: !561, file: !561, line: 79, type: !1046, scopeLine: 83, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1053)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!141, !1037, !87, !1038, !1048}
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "collect_vlans", file: !561, line: 64, size: 32, elements: !1050)
!1050 = !{!1051}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1049, file: !561, line: 65, baseType: !1052, size: 32)
!1052 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 32, elements: !159)
!1053 = !{!1044, !1054, !1055, !1056, !1057, !1058, !1059, !1065, !1066}
!1054 = !DILocalVariable(name: "data_end", arg: 2, scope: !1045, file: !561, line: 80, type: !87)
!1055 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !1045, file: !561, line: 81, type: !1038)
!1056 = !DILocalVariable(name: "vlans", arg: 4, scope: !1045, file: !561, line: 82, type: !1048)
!1057 = !DILocalVariable(name: "eth", scope: !1045, file: !561, line: 84, type: !514)
